zephyrproject-rtos/hal_ambiq/dts/apollo510L/ambiq-apollo510L-pinmux.h
/*
 * Copyright (c) 2024 Ambiq Micro Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Generated on 12/26/2024
 */

#ifndef __APOLLO510L_PINMUX_H__
#define __APOLLO510L_PINMUX_H__

#include <zephyr/dt-bindings/pinctrl/ambiq-apollo5-pinctrl.h>

#define SWTRACECLK_P0           APOLLO5_PINMUX(0,0)
#define SLFDSCK_P0              APOLLO5_PINMUX(0,1)
#define DISP_QSPI_D0_P0         APOLLO5_PINMUX(0,2)
#define GPIO_P0                 APOLLO5_PINMUX(0,3)
#define DISP_SPI_SD_P0          APOLLO5_PINMUX(0,4)
#define DISP_SPI_SDO_P0         APOLLO5_PINMUX(0,5)
#define CT0_P0                  APOLLO5_PINMUX(0,6)
#define NCE0_P0                 APOLLO5_PINMUX(0,7)
#define OBSBUS0_P0              APOLLO5_PINMUX(0,8)
#define RESERVED9_P0            APOLLO5_PINMUX(0,9)
#define RESERVED10_P0           APOLLO5_PINMUX(0,10)
#define FPIO_P0                 APOLLO5_PINMUX(0,11)
#define SLFDSCL_P0              APOLLO5_PINMUX(0,12)
#define DISP_QSPI_D0_OUT_P0     APOLLO5_PINMUX(0,13)
#define RESERVED14_P0           APOLLO5_PINMUX(0,14)
#define RESERVED15_P0           APOLLO5_PINMUX(0,15)

#define SWTRACE0_P1             APOLLO5_PINMUX(1,0)
#define SLFDMOSI_P1             APOLLO5_PINMUX(1,1)
#define DISP_QSPI_D1_P1         APOLLO5_PINMUX(1,2)
#define GPIO_P1                 APOLLO5_PINMUX(1,3)
#define DISP_SPI_DCX_P1         APOLLO5_PINMUX(1,4)
#define RESERVED5_P1            APOLLO5_PINMUX(1,5)
#define CT1_P1                  APOLLO5_PINMUX(1,6)
#define NCE1_P1                 APOLLO5_PINMUX(1,7)
#define OBSBUS1_P1              APOLLO5_PINMUX(1,8)
#define UART0TX_P1              APOLLO5_PINMUX(1,9)
#define UART1CTS_P1             APOLLO5_PINMUX(1,10)
#define FPIO_P1                 APOLLO5_PINMUX(1,11)
#define SLFDSDAWIR3_P1          APOLLO5_PINMUX(1,12)
#define RESERVED13_P1           APOLLO5_PINMUX(1,13)
#define RESERVED14_P1           APOLLO5_PINMUX(1,14)
#define RESERVED15_P1           APOLLO5_PINMUX(1,15)

#define SWTRACE1_P2             APOLLO5_PINMUX(2,0)
#define SLFDMISO_P2             APOLLO5_PINMUX(2,1)
#define DISP_QSPI_SCK_P2        APOLLO5_PINMUX(2,2)
#define GPIO_P2                 APOLLO5_PINMUX(2,3)
#define DISP_SPI_SCK_P2         APOLLO5_PINMUX(2,4)
#define RESERVED5_P2            APOLLO5_PINMUX(2,5)
#define CT2_P2                  APOLLO5_PINMUX(2,6)
#define NCE2_P2                 APOLLO5_PINMUX(2,7)
#define OBSBUS2_P2              APOLLO5_PINMUX(2,8)
#define UART0RX_P2              APOLLO5_PINMUX(2,9)
#define UART1RTS_P2             APOLLO5_PINMUX(2,10)
#define FPIO_P2                 APOLLO5_PINMUX(2,11)
#define XT_EXT_P2               APOLLO5_PINMUX(2,12)
#define FLB_FCLK_P2             APOLLO5_PINMUX(2,13)
#define RESERVED14_P2           APOLLO5_PINMUX(2,14)
#define RESERVED15_P2           APOLLO5_PINMUX(2,15)

#define SWTRACE2_P3             APOLLO5_PINMUX(3,0)
#define SLFDnCE_P3              APOLLO5_PINMUX(3,1)
#define DISP_QSPI_D2_P3         APOLLO5_PINMUX(3,2)
#define GPIO_P3                 APOLLO5_PINMUX(3,3)
#define DISP_SPI_SDI_P3         APOLLO5_PINMUX(3,4)
#define RESERVED5_P3            APOLLO5_PINMUX(3,5)
#define CT3_P3                  APOLLO5_PINMUX(3,6)
#define NCE3_P3                 APOLLO5_PINMUX(3,7)
#define OBSBUS3_P3              APOLLO5_PINMUX(3,8)
#define RESERVED9_P3            APOLLO5_PINMUX(3,9)
#define RESERVED10_P3           APOLLO5_PINMUX(3,10)
#define FPIO_P3                 APOLLO5_PINMUX(3,11)
#define LFRC_EXT_P3             APOLLO5_PINMUX(3,12)
#define FLB_TDI_P3              APOLLO5_PINMUX(3,13)
#define MDA_TDI_P3              APOLLO5_PINMUX(3,14)
#define RESERVED15_P3           APOLLO5_PINMUX(3,15)

#define SWTRACE3_P4             APOLLO5_PINMUX(4,0)
#define SLFDINT_P4              APOLLO5_PINMUX(4,1)
#define DISP_QSPI_D3_P4         APOLLO5_PINMUX(4,2)
#define GPIO_P4                 APOLLO5_PINMUX(4,3)
#define DISP_SPI_RST_P4         APOLLO5_PINMUX(4,4)
#define RESERVED5_P4            APOLLO5_PINMUX(4,5)
#define CT4_P4                  APOLLO5_PINMUX(4,6)
#define NCE4_P4                 APOLLO5_PINMUX(4,7)
#define OBSBUS4_P4              APOLLO5_PINMUX(4,8)
#define UART1TX_P4              APOLLO5_PINMUX(4,9)
#define UART0CTS_P4             APOLLO5_PINMUX(4,10)
#define FPIO_P4                 APOLLO5_PINMUX(4,11)
#define HFRC_EXT_P4             APOLLO5_PINMUX(4,12)
#define RESERVED13_P4           APOLLO5_PINMUX(4,13)
#define RESERVED14_P4           APOLLO5_PINMUX(4,14)
#define RESERVED15_P4           APOLLO5_PINMUX(4,15)

#define M0SCL_P5                APOLLO5_PINMUX(5,0)
#define M0SCK_P5                APOLLO5_PINMUX(5,1)
#define PDMI2S0_SDOUT_P5        APOLLO5_PINMUX(5,2)
#define GPIO_P5                 APOLLO5_PINMUX(5,3)
#define RESERVED4_P5            APOLLO5_PINMUX(5,4)
#define XT32KHz_P5              APOLLO5_PINMUX(5,5)
#define CT5_P5                  APOLLO5_PINMUX(5,6)
#define NCE5_P5                 APOLLO5_PINMUX(5,7)
#define OBSBUS5_P5              APOLLO5_PINMUX(5,8)
#define UART1RX_P5              APOLLO5_PINMUX(5,9)
#define UART0RTS_P5             APOLLO5_PINMUX(5,10)
#define FPIO_P5                 APOLLO5_PINMUX(5,11)
#define I2S0_SDOUT_P5           APOLLO5_PINMUX(5,12)
#define I2S0_DATA_P5            APOLLO5_PINMUX(5,13)
#define RESERVED14_P5           APOLLO5_PINMUX(5,14)
#define OPCG_TRIG_P5            APOLLO5_PINMUX(5,15)

#define M0SDAWIR3_P6            APOLLO5_PINMUX(6,0)
#define M0MOSI_P6               APOLLO5_PINMUX(6,1)
#define PDMI2S0_WS_P6           APOLLO5_PINMUX(6,2)
#define GPIO_P6                 APOLLO5_PINMUX(6,3)
#define CLKOUT_P6               APOLLO5_PINMUX(6,4)
#define RESERVED5_P6            APOLLO5_PINMUX(6,5)
#define CT6_P6                  APOLLO5_PINMUX(6,6)
#define NCE6_P6                 APOLLO5_PINMUX(6,7)
#define OBSBUS6_P6              APOLLO5_PINMUX(6,8)
#define UART0TX_P6              APOLLO5_PINMUX(6,9)
#define UART1CTS_P6             APOLLO5_PINMUX(6,10)
#define FPIO_P6                 APOLLO5_PINMUX(6,11)
#define I2S0_WS_P6              APOLLO5_PINMUX(6,12)
#define FLB_TMS_P6              APOLLO5_PINMUX(6,13)
#define MDA_TMS_P6              APOLLO5_PINMUX(6,14)
#define SCANIN0_P6              APOLLO5_PINMUX(6,15)

#define M0MISO_P7               APOLLO5_PINMUX(7,0)
#define VCMPO_P7                APOLLO5_PINMUX(7,1)
#define RESERVED2_P7            APOLLO5_PINMUX(7,2)
#define GPIO_P7                 APOLLO5_PINMUX(7,3)
#define TRIG0_P7                APOLLO5_PINMUX(7,4)
#define RESERVED5_P7            APOLLO5_PINMUX(7,5)
#define CT7_P7                  APOLLO5_PINMUX(7,6)
#define NCE7_P7                 APOLLO5_PINMUX(7,7)
#define OBSBUS7_P7              APOLLO5_PINMUX(7,8)
#define UART0RX_P7              APOLLO5_PINMUX(7,9)
#define UART1RTS_P7             APOLLO5_PINMUX(7,10)
#define FPIO_P7                 APOLLO5_PINMUX(7,11)
#define I2S0_SDIN_P7            APOLLO5_PINMUX(7,12)
#define FLB_TRSTN_P7            APOLLO5_PINMUX(7,13)
#define MDA_TRSTN_P7            APOLLO5_PINMUX(7,14)
#define SCANIN1_P7              APOLLO5_PINMUX(7,15)

#define CMPRF1_P8               APOLLO5_PINMUX(8,0)
#define M1SCL_P8                APOLLO5_PINMUX(8,1)
#define M1SCK_P8                APOLLO5_PINMUX(8,2)
#define GPIO_P8                 APOLLO5_PINMUX(8,3)
#define TRIG1_P8                APOLLO5_PINMUX(8,4)
#define AO_OBSBUS0_P8           APOLLO5_PINMUX(8,5)
#define CT8_P8                  APOLLO5_PINMUX(8,6)
#define NCE8_P8                 APOLLO5_PINMUX(8,7)
#define OBSBUS8_P8              APOLLO5_PINMUX(8,8)
#define UART1TX_P8              APOLLO5_PINMUX(8,9)
#define UART0CTS_P8             APOLLO5_PINMUX(8,10)
#define FPIO_P8                 APOLLO5_PINMUX(8,11)
#define RESERVED12_P8           APOLLO5_PINMUX(8,12)
#define RESERVED13_P8           APOLLO5_PINMUX(8,13)
#define RESERVED14_P8           APOLLO5_PINMUX(8,14)
#define SCANIN2_P8              APOLLO5_PINMUX(8,15)

