zephyrproject-rtos/hal_ambiq/dts/apollo510L/ambiq-apollo510L-pinmux.h
#define CMPRF0_P9               APOLLO5_PINMUX(9,0)
#define M1SDAWIR3_P9            APOLLO5_PINMUX(9,1)
#define M1MOSI_P9               APOLLO5_PINMUX(9,2)
#define GPIO_P9                 APOLLO5_PINMUX(9,3)
#define TRIG2_P9                APOLLO5_PINMUX(9,4)
#define AO_OBSBUS1_P9           APOLLO5_PINMUX(9,5)
#define CT9_P9                  APOLLO5_PINMUX(9,6)
#define NCE9_P9                 APOLLO5_PINMUX(9,7)
#define OBSBUS9_P9              APOLLO5_PINMUX(9,8)
#define UART1RX_P9              APOLLO5_PINMUX(9,9)
#define UART0RTS_P9             APOLLO5_PINMUX(9,10)
#define FPIO_P9                 APOLLO5_PINMUX(9,11)
#define RESERVED12_P9           APOLLO5_PINMUX(9,12)
#define RESERVED13_P9           APOLLO5_PINMUX(9,13)
#define RESERVED14_P9           APOLLO5_PINMUX(9,14)
#define SCANIN3_P9              APOLLO5_PINMUX(9,15)

#define CMPIN0_P10              APOLLO5_PINMUX(10,0)
#define M1MISO_P10              APOLLO5_PINMUX(10,1)
#define PDMI2S0_CLK_P10         APOLLO5_PINMUX(10,2)
#define GPIO_P10                APOLLO5_PINMUX(10,3)
#define TRIG3_P10               APOLLO5_PINMUX(10,4)
#define AO_OBSBUS2_P10          APOLLO5_PINMUX(10,5)
#define CT10_P10                APOLLO5_PINMUX(10,6)
#define NCE10_P10               APOLLO5_PINMUX(10,7)
#define OBSBUS10_P10            APOLLO5_PINMUX(10,8)
#define UART0TX_P10             APOLLO5_PINMUX(10,9)
#define UART1CTS_P10            APOLLO5_PINMUX(10,10)
#define FPIO_P10                APOLLO5_PINMUX(10,11)
#define I2S0_CLK_P10            APOLLO5_PINMUX(10,12)
#define RESERVED13_P10          APOLLO5_PINMUX(10,13)
#define RESERVED14_P10          APOLLO5_PINMUX(10,14)
#define SCANIN4_P10             APOLLO5_PINMUX(10,15)

#define CMPIN1_P11              APOLLO5_PINMUX(11,0)
#define RESERVED1_P11           APOLLO5_PINMUX(11,1)
#define PDMI2S0_CLK_P11         APOLLO5_PINMUX(11,2)
#define GPIO_P11                APOLLO5_PINMUX(11,3)
#define TRIG0_P11               APOLLO5_PINMUX(11,4)
#define AO_OBSBUS3_P11          APOLLO5_PINMUX(11,5)
#define CT11_P11                APOLLO5_PINMUX(11,6)
#define NCE11_P11               APOLLO5_PINMUX(11,7)
#define OBSBUS11_P11            APOLLO5_PINMUX(11,8)
#define UART0RX_P11             APOLLO5_PINMUX(11,9)
#define UART1RTS_P11            APOLLO5_PINMUX(11,10)
#define FPIO_P11                APOLLO5_PINMUX(11,11)
#define I2S0_CLK_P11            APOLLO5_PINMUX(11,12)
#define RESERVED13_P11          APOLLO5_PINMUX(11,13)
#define RESERVED14_P11          APOLLO5_PINMUX(11,14)
#define SCANIN5_P11             APOLLO5_PINMUX(11,15)

#define ADCSE7_P12              APOLLO5_PINMUX(12,0)
#define RESERVED1_P12           APOLLO5_PINMUX(12,1)
#define PDMI2S0_WS_P12          APOLLO5_PINMUX(12,2)
#define GPIO_P12                APOLLO5_PINMUX(12,3)
#define TRIG1_P12               APOLLO5_PINMUX(12,4)
#define CMPRF2_P12              APOLLO5_PINMUX(12,5)
#define CT12_P12                APOLLO5_PINMUX(12,6)
#define NCE12_P12               APOLLO5_PINMUX(12,7)
#define OBSBUS12_P12            APOLLO5_PINMUX(12,8)
#define UART1TX_P12             APOLLO5_PINMUX(12,9)
#define UART0CTS_P12            APOLLO5_PINMUX(12,10)
#define FPIO_P12                APOLLO5_PINMUX(12,11)
#define I2S0_WS_P12             APOLLO5_PINMUX(12,12)
#define AO_OBSBUS0_P12          APOLLO5_PINMUX(12,13)
#define RESERVED14_P12          APOLLO5_PINMUX(12,14)
#define SCANIN6_P12             APOLLO5_PINMUX(12,15)

#define ADCSE6_P13              APOLLO5_PINMUX(13,0)
#define RESERVED1_P13           APOLLO5_PINMUX(13,1)
#define PDMI2S0_SDOUT_P13       APOLLO5_PINMUX(13,2)
#define GPIO_P13                APOLLO5_PINMUX(13,3)
#define TRIG2_P13               APOLLO5_PINMUX(13,4)
#define AO_OBSBUS1_P13          APOLLO5_PINMUX(13,5)
#define CT13_P13                APOLLO5_PINMUX(13,6)
#define NCE13_P13               APOLLO5_PINMUX(13,7)
#define OBSBUS13_P13            APOLLO5_PINMUX(13,8)
#define UART1RX_P13             APOLLO5_PINMUX(13,9)
#define UART0RTS_P13            APOLLO5_PINMUX(13,10)
#define FPIO_P13                APOLLO5_PINMUX(13,11)
#define I2S0_SDOUT_P13          APOLLO5_PINMUX(13,12)
#define I2S0_DATA_P13           APOLLO5_PINMUX(13,13)
#define RESERVED14_P13          APOLLO5_PINMUX(13,14)
#define SCANIN7_P13             APOLLO5_PINMUX(13,15)

#define ADCSE5_P14              APOLLO5_PINMUX(14,0)
#define RESERVED1_P14           APOLLO5_PINMUX(14,1)
#define RESERVED2_P14           APOLLO5_PINMUX(14,2)
#define GPIO_P14                APOLLO5_PINMUX(14,3)
#define TRIG3_P14               APOLLO5_PINMUX(14,4)
#define AO_OBSBUS2_P14          APOLLO5_PINMUX(14,5)
#define CT14_P14                APOLLO5_PINMUX(14,6)
#define NCE14_P14               APOLLO5_PINMUX(14,7)
#define OBSBUS14_P14            APOLLO5_PINMUX(14,8)
#define UART0TX_P14             APOLLO5_PINMUX(14,9)
#define UART1CTS_P14            APOLLO5_PINMUX(14,10)
#define FPIO_P14                APOLLO5_PINMUX(14,11)
#define I2S0_SDIN_P14           APOLLO5_PINMUX(14,12)
#define RESERVED13_P14          APOLLO5_PINMUX(14,13)
#define RESERVED14_P14          APOLLO5_PINMUX(14,14)
#define SCANIN8_P14             APOLLO5_PINMUX(14,15)

#define ADCSE4_P15              APOLLO5_PINMUX(15,0)
#define REFCLK_EXT_P15          APOLLO5_PINMUX(15,1)
#define RESERVED2_P15           APOLLO5_PINMUX(15,2)
#define GPIO_P15                APOLLO5_PINMUX(15,3)
#define TRIG0_P15               APOLLO5_PINMUX(15,4)
#define AO_OBSBUS3_P15          APOLLO5_PINMUX(15,5)
#define CT15_P15                APOLLO5_PINMUX(15,6)
#define NCE15_P15               APOLLO5_PINMUX(15,7)
#define OBSBUS15_P15            APOLLO5_PINMUX(15,8)
#define UART0RX_P15             APOLLO5_PINMUX(15,9)
#define UART1RTS_P15            APOLLO5_PINMUX(15,10)
#define FPIO_P15                APOLLO5_PINMUX(15,11)
#define RESERVED12_P15          APOLLO5_PINMUX(15,12)
#define RESERVED13_P15          APOLLO5_PINMUX(15,13)
#define RESERVED14_P15          APOLLO5_PINMUX(15,14)
#define SCANIN9_P15             APOLLO5_PINMUX(15,15)

#define ADCSE3_P16              APOLLO5_PINMUX(16,0)
#define EN192MHz_P16            APOLLO5_PINMUX(16,1)
#define RESERVED2_P16           APOLLO5_PINMUX(16,2)
#define GPIO_P16                APOLLO5_PINMUX(16,3)
#define TRIG1_P16               APOLLO5_PINMUX(16,4)
#define AO_OBSBUS0_P16          APOLLO5_PINMUX(16,5)
#define CT16_P16                APOLLO5_PINMUX(16,6)
#define NCE16_P16               APOLLO5_PINMUX(16,7)
#define OBSBUS0_P16             APOLLO5_PINMUX(16,8)
#define UART0TX_P16             APOLLO5_PINMUX(16,9)
#define UART1CTS_P16            APOLLO5_PINMUX(16,10)
#define FPIO_P16                APOLLO5_PINMUX(16,11)
#define RESERVED12_P16          APOLLO5_PINMUX(16,12)
#define RESERVED13_P16          APOLLO5_PINMUX(16,13)
#define RESERVED14_P16          APOLLO5_PINMUX(16,14)
#define LPG_ENABLE_P16          APOLLO5_PINMUX(16,15)

