zephyrproject-rtos/hal_ambiq/dts/apollo510L/ambiq-apollo510L-pinmux.h
#define ADCSE2_P17              APOLLO5_PINMUX(17,0)
#define CLK192MHz_P17           APOLLO5_PINMUX(17,1)
#define RESERVED2_P17           APOLLO5_PINMUX(17,2)
#define GPIO_P17                APOLLO5_PINMUX(17,3)
#define TRIG2_P17               APOLLO5_PINMUX(17,4)
#define AO_OBSBUS1_P17          APOLLO5_PINMUX(17,5)
#define CT17_P17                APOLLO5_PINMUX(17,6)
#define NCE17_P17               APOLLO5_PINMUX(17,7)
#define OBSBUS1_P17             APOLLO5_PINMUX(17,8)
#define UART0RX_P17             APOLLO5_PINMUX(17,9)
#define UART1RTS_P17            APOLLO5_PINMUX(17,10)
#define FPIO_P17                APOLLO5_PINMUX(17,11)
#define RESERVED12_P17          APOLLO5_PINMUX(17,12)
#define RESERVED13_P17          APOLLO5_PINMUX(17,13)
#define RESERVED14_P17          APOLLO5_PINMUX(17,14)
#define SCANRST_P17             APOLLO5_PINMUX(17,15)

#define ADCSE1_P18              APOLLO5_PINMUX(18,0)
#define ANATEST2_P18            APOLLO5_PINMUX(18,1)
#define RESERVED2_P18           APOLLO5_PINMUX(18,2)
#define GPIO_P18                APOLLO5_PINMUX(18,3)
#define TRIG3_P18               APOLLO5_PINMUX(18,4)
#define AO_OBSBUS2_P18          APOLLO5_PINMUX(18,5)
#define CT18_P18                APOLLO5_PINMUX(18,6)
#define NCE18_P18               APOLLO5_PINMUX(18,7)
#define OBSBUS2_P18             APOLLO5_PINMUX(18,8)
#define UART1TX_P18             APOLLO5_PINMUX(18,9)
#define UART0CTS_P18            APOLLO5_PINMUX(18,10)
#define FPIO_P18                APOLLO5_PINMUX(18,11)
#define RESERVED12_P18          APOLLO5_PINMUX(18,12)
#define RESERVED13_P18          APOLLO5_PINMUX(18,13)
#define MDA_SRST_P18            APOLLO5_PINMUX(18,14)
#define RESERVED15_P18          APOLLO5_PINMUX(18,15)

#define ADCSE0_P19              APOLLO5_PINMUX(19,0)
#define ANATEST1_P19            APOLLO5_PINMUX(19,1)
#define RESERVED2_P19           APOLLO5_PINMUX(19,2)
#define GPIO_P19                APOLLO5_PINMUX(19,3)
#define TRIG0_P19               APOLLO5_PINMUX(19,4)
#define AO_OBSBUS3_P19          APOLLO5_PINMUX(19,5)
#define CT19_P19                APOLLO5_PINMUX(19,6)
#define NCE19_P19               APOLLO5_PINMUX(19,7)
#define OBSBUS3_P19             APOLLO5_PINMUX(19,8)
#define UART1RX_P19             APOLLO5_PINMUX(19,9)
#define UART0RTS_P19            APOLLO5_PINMUX(19,10)
#define FPIO_P19                APOLLO5_PINMUX(19,11)
#define RESERVED12_P19          APOLLO5_PINMUX(19,12)
#define FLLOAD_STRB_P19         APOLLO5_PINMUX(19,13)
#define RESERVED14_P19          APOLLO5_PINMUX(19,14)
#define DFT_ISO_P19             APOLLO5_PINMUX(19,15)

#define SWDCK_P20               APOLLO5_PINMUX(20,0)
#define RESERVED1_P20           APOLLO5_PINMUX(20,1)
#define RESERVED2_P20           APOLLO5_PINMUX(20,2)
#define GPIO_P20                APOLLO5_PINMUX(20,3)
#define TRIG1_P20               APOLLO5_PINMUX(20,4)
#define RESERVED5_P20           APOLLO5_PINMUX(20,5)
#define CT20_P20                APOLLO5_PINMUX(20,6)
#define NCE20_P20               APOLLO5_PINMUX(20,7)
#define OBSBUS4_P20             APOLLO5_PINMUX(20,8)
#define UART1TX_P20             APOLLO5_PINMUX(20,9)
#define UART0CTS_P20            APOLLO5_PINMUX(20,10)
#define FPIO_P20                APOLLO5_PINMUX(20,11)
#define RESERVED12_P20          APOLLO5_PINMUX(20,12)
#define FLB_TCLK_P20            APOLLO5_PINMUX(20,13)
#define MDA_TCK_P20             APOLLO5_PINMUX(20,14)
#define SCANCLK_P20             APOLLO5_PINMUX(20,15)

#define SWDIO_P21               APOLLO5_PINMUX(21,0)
#define RESERVED1_P21           APOLLO5_PINMUX(21,1)
#define RESERVED2_P21           APOLLO5_PINMUX(21,2)
#define GPIO_P21                APOLLO5_PINMUX(21,3)
#define TRIG2_P21               APOLLO5_PINMUX(21,4)
#define RESERVED5_P21           APOLLO5_PINMUX(21,5)
#define CT21_P21                APOLLO5_PINMUX(21,6)
#define NCE21_P21               APOLLO5_PINMUX(21,7)
#define OBSBUS5_P21             APOLLO5_PINMUX(21,8)
#define UART1RX_P21             APOLLO5_PINMUX(21,9)
#define UART0RTS_P21            APOLLO5_PINMUX(21,10)
#define FPIO_P21                APOLLO5_PINMUX(21,11)
#define RESERVED12_P21          APOLLO5_PINMUX(21,12)
#define FLB_TDO_P21             APOLLO5_PINMUX(21,13)
#define MDA_TDO_P21             APOLLO5_PINMUX(21,14)
#define SCANSHFT_P21            APOLLO5_PINMUX(21,15)

#define M5SCL_P22               APOLLO5_PINMUX(22,0)
#define M5SCK_P22               APOLLO5_PINMUX(22,1)
#define RESERVED2_P22           APOLLO5_PINMUX(22,2)
#define GPIO_P22                APOLLO5_PINMUX(22,3)
#define TRIG3_P22               APOLLO5_PINMUX(22,4)
#define SWO_P22                 APOLLO5_PINMUX(22,5)
#define CT22_P22                APOLLO5_PINMUX(22,6)
#define NCE22_P22               APOLLO5_PINMUX(22,7)
#define OBSBUS6_P22             APOLLO5_PINMUX(22,8)
#define UART0TX_P22             APOLLO5_PINMUX(22,9)
#define UART1CTS_P22            APOLLO5_PINMUX(22,10)
#define FPIO_P22                APOLLO5_PINMUX(22,11)
#define RF_XCVR_TST0_P22        APOLLO5_PINMUX(22,12)
#define RESERVED13_P22          APOLLO5_PINMUX(22,13)
#define RESERVED14_P22          APOLLO5_PINMUX(22,14)
#define OPCG_LOAD_P22           APOLLO5_PINMUX(22,15)

#define M5SDAWIR3_P23           APOLLO5_PINMUX(23,0)
#define M5MOSI_P23              APOLLO5_PINMUX(23,1)
#define BTDM_RXEN_P23           APOLLO5_PINMUX(23,2)
#define GPIO_P23                APOLLO5_PINMUX(23,3)
#define TRIG0_P23               APOLLO5_PINMUX(23,4)
#define SWO_P23                 APOLLO5_PINMUX(23,5)
#define CT23_P23                APOLLO5_PINMUX(23,6)
#define NCE23_P23               APOLLO5_PINMUX(23,7)
#define OBSBUS7_P23             APOLLO5_PINMUX(23,8)
#define UART0RX_P23             APOLLO5_PINMUX(23,9)
#define UART1RTS_P23            APOLLO5_PINMUX(23,10)
#define FPIO_P23                APOLLO5_PINMUX(23,11)
#define ST_WCI_2W_RXD_P23       APOLLO5_PINMUX(23,12)
#define RESERVED13_P23          APOLLO5_PINMUX(23,13)
#define RESERVED14_P23          APOLLO5_PINMUX(23,14)
#define LPG_LOAD_P23            APOLLO5_PINMUX(23,15)

#define M5MISO_P24              APOLLO5_PINMUX(24,0)
#define RESERVED1_P24           APOLLO5_PINMUX(24,1)
#define BTDM_TXEN_P24           APOLLO5_PINMUX(24,2)
#define GPIO_P24                APOLLO5_PINMUX(24,3)
#define TRIG1_P24               APOLLO5_PINMUX(24,4)
#define SWO_P24                 APOLLO5_PINMUX(24,5)
#define CT24_P24                APOLLO5_PINMUX(24,6)
#define NCE24_P24               APOLLO5_PINMUX(24,7)
#define OBSBUS8_P24             APOLLO5_PINMUX(24,8)
#define UART1TX_P24             APOLLO5_PINMUX(24,9)
#define UART0CTS_P24            APOLLO5_PINMUX(24,10)
#define FPIO_P24                APOLLO5_PINMUX(24,11)
#define ST_WCI_1W_RXD_P24       APOLLO5_PINMUX(24,12)
#define ST_WCI_2W_TXD_P24       APOLLO5_PINMUX(24,13)
#define RESERVED14_P24          APOLLO5_PINMUX(24,14)
#define EN96MHz_P24             APOLLO5_PINMUX(24,15)

#define M2SCL_P25               APOLLO5_PINMUX(25,0)
#define M2SCK_P25               APOLLO5_PINMUX(25,1)
#define VCMPO_P25               APOLLO5_PINMUX(25,2)
#define GPIO_P25                APOLLO5_PINMUX(25,3)
#define TRIG2_P25               APOLLO5_PINMUX(25,4)
#define RESERVED5_P25           APOLLO5_PINMUX(25,5)
#define CT25_P25                APOLLO5_PINMUX(25,6)
#define NCE25_P25               APOLLO5_PINMUX(25,7)
#define OBSBUS9_P25             APOLLO5_PINMUX(25,8)
#define UART1RX_P25             APOLLO5_PINMUX(25,9)
#define UART0RTS_P25            APOLLO5_PINMUX(25,10)
#define FPIO_P25                APOLLO5_PINMUX(25,11)
#define RESERVED12_P25          APOLLO5_PINMUX(25,12)
#define RESERVED13_P25          APOLLO5_PINMUX(25,13)
#define RESERVED14_P25          APOLLO5_PINMUX(25,14)
#define CLK96MHz_P25            APOLLO5_PINMUX(25,15)

