zephyrproject-rtos/hal_ambiq/dts/apollo510L/ambiq-apollo510L-pinmux.h
#define M2SDAWIR3_P26           APOLLO5_PINMUX(26,0)
#define M2MOSI_P26              APOLLO5_PINMUX(26,1)
#define RESERVED2_P26           APOLLO5_PINMUX(26,2)
#define GPIO_P26                APOLLO5_PINMUX(26,3)
#define TRIG3_P26               APOLLO5_PINMUX(26,4)
#define SWTRACECTL_P26          APOLLO5_PINMUX(26,5)
#define CT26_P26                APOLLO5_PINMUX(26,6)
#define NCE26_P26               APOLLO5_PINMUX(26,7)
#define OBSBUS10_P26            APOLLO5_PINMUX(26,8)
#define UART0TX_P26             APOLLO5_PINMUX(26,9)
#define UART1CTS_P26            APOLLO5_PINMUX(26,10)
#define FPIO_P26                APOLLO5_PINMUX(26,11)
#define RESERVED12_P26          APOLLO5_PINMUX(26,12)
#define RESERVED13_P26          APOLLO5_PINMUX(26,13)
#define RESERVED14_P26          APOLLO5_PINMUX(26,14)
#define CME_P26                 APOLLO5_PINMUX(26,15)

#define M2MISO_P27              APOLLO5_PINMUX(27,0)
#define I2S0_MCLK_P27           APOLLO5_PINMUX(27,1)
#define VCMPO_P27               APOLLO5_PINMUX(27,2)
#define GPIO_P27                APOLLO5_PINMUX(27,3)
#define TRIG0_P27               APOLLO5_PINMUX(27,4)
#define RESERVED5_P27           APOLLO5_PINMUX(27,5)
#define CT27_P27                APOLLO5_PINMUX(27,6)
#define NCE27_P27               APOLLO5_PINMUX(27,7)
#define OBSBUS11_P27            APOLLO5_PINMUX(27,8)
#define UART0RX_P27             APOLLO5_PINMUX(27,9)
#define UART1RTS_P27            APOLLO5_PINMUX(27,10)
#define FPIO_P27                APOLLO5_PINMUX(27,11)
#define RESERVED12_P27          APOLLO5_PINMUX(27,12)
#define RESERVED13_P27          APOLLO5_PINMUX(27,13)
#define RESERVED14_P27          APOLLO5_PINMUX(27,14)
#define CMLE_P27                APOLLO5_PINMUX(27,15)

#define SWO_P28                 APOLLO5_PINMUX(28,0)
#define SWTRACECTL_P28          APOLLO5_PINMUX(28,1)
#define RESERVED2_P28           APOLLO5_PINMUX(28,2)
#define GPIO_P28                APOLLO5_PINMUX(28,3)
#define TRIG1_P28               APOLLO5_PINMUX(28,4)
#define RESERVED5_P28           APOLLO5_PINMUX(28,5)
#define CT28_P28                APOLLO5_PINMUX(28,6)
#define NCE28_P28               APOLLO5_PINMUX(28,7)
#define OBSBUS12_P28            APOLLO5_PINMUX(28,8)
#define UART1RX_P28             APOLLO5_PINMUX(28,9)
#define UART0RTS_P28            APOLLO5_PINMUX(28,10)
#define FPIO_P28                APOLLO5_PINMUX(28,11)
#define RESERVED12_P28          APOLLO5_PINMUX(28,12)
#define RESERVED13_P28          APOLLO5_PINMUX(28,13)
#define RESERVED14_P28          APOLLO5_PINMUX(28,14)
#define RESERVED15_P28          APOLLO5_PINMUX(28,15)

#define M3SCL_P29               APOLLO5_PINMUX(29,0)
#define M3SCK_P29               APOLLO5_PINMUX(29,1)
#define RESERVED2_P29           APOLLO5_PINMUX(29,2)
#define GPIO_P29                APOLLO5_PINMUX(29,3)
#define TRIG2_P29               APOLLO5_PINMUX(29,4)
#define RESERVED5_P29           APOLLO5_PINMUX(29,5)
#define CT29_P29                APOLLO5_PINMUX(29,6)
#define NCE29_P29               APOLLO5_PINMUX(29,7)
#define OBSBUS13_P29            APOLLO5_PINMUX(29,8)
#define UART1TX_P29             APOLLO5_PINMUX(29,9)
#define UART0CTS_P29            APOLLO5_PINMUX(29,10)
#define FPIO_P29                APOLLO5_PINMUX(29,11)
#define I2S0_SDIN_P29           APOLLO5_PINMUX(29,12)
#define RESERVED13_P29          APOLLO5_PINMUX(29,13)
#define MDA_HFRC_EXT_P29        APOLLO5_PINMUX(29,14)
#define DFT_RET_P29             APOLLO5_PINMUX(29,15)

#define M3SDAWIR3_P30           APOLLO5_PINMUX(30,0)
#define M3MOSI_P30              APOLLO5_PINMUX(30,1)
#define PDMI2S0_SDOUT_P30       APOLLO5_PINMUX(30,2)
#define GPIO_P30                APOLLO5_PINMUX(30,3)
#define TRIG3_P30               APOLLO5_PINMUX(30,4)
#define RESERVED5_P30           APOLLO5_PINMUX(30,5)
#define CT30_P30                APOLLO5_PINMUX(30,6)
#define NCE30_P30               APOLLO5_PINMUX(30,7)
#define OBSBUS14_P30            APOLLO5_PINMUX(30,8)
#define UART0TX_P30             APOLLO5_PINMUX(30,9)
#define UART1CTS_P30            APOLLO5_PINMUX(30,10)
#define FPIO_P30                APOLLO5_PINMUX(30,11)
#define I2S0_SDOUT_P30          APOLLO5_PINMUX(30,12)
#define I2S0_DATA_P30           APOLLO5_PINMUX(30,13)
#define RESERVED14_P30          APOLLO5_PINMUX(30,14)
#define SCANOUT0_P30            APOLLO5_PINMUX(30,15)

#define M3MISO_P31              APOLLO5_PINMUX(31,0)
#define CLKOUT_P31              APOLLO5_PINMUX(31,1)
#define PDMI2S0_WS_P31          APOLLO5_PINMUX(31,2)
#define GPIO_P31                APOLLO5_PINMUX(31,3)
#define TRIG0_P31               APOLLO5_PINMUX(31,4)
#define COEX_GRANT_P31          APOLLO5_PINMUX(31,5)
#define CT31_P31                APOLLO5_PINMUX(31,6)
#define NCE31_P31               APOLLO5_PINMUX(31,7)
#define OBSBUS15_P31            APOLLO5_PINMUX(31,8)
#define UART0RX_P31             APOLLO5_PINMUX(31,9)
#define UART1RTS_P31            APOLLO5_PINMUX(31,10)
#define FPIO_P31                APOLLO5_PINMUX(31,11)
#define I2S0_WS_P31             APOLLO5_PINMUX(31,12)
#define RESERVED13_P31          APOLLO5_PINMUX(31,13)
#define RESERVED14_P31          APOLLO5_PINMUX(31,14)
#define SCANOUT1_P31            APOLLO5_PINMUX(31,15)

#define M4SCL_P32               APOLLO5_PINMUX(32,0)
#define M4SCK_P32               APOLLO5_PINMUX(32,1)
#define RESERVED2_P32           APOLLO5_PINMUX(32,2)
#define GPIO_P32                APOLLO5_PINMUX(32,3)
#define TRIG1_P32               APOLLO5_PINMUX(32,4)
#define COEX_REQ_P32            APOLLO5_PINMUX(32,5)
#define CT32_P32                APOLLO5_PINMUX(32,6)
#define NCE32_P32               APOLLO5_PINMUX(32,7)
#define OBSBUS0_P32             APOLLO5_PINMUX(32,8)
#define UART1TX_P32             APOLLO5_PINMUX(32,9)
#define UART0CTS_P32            APOLLO5_PINMUX(32,10)
#define FPIO_P32                APOLLO5_PINMUX(32,11)
#define RESERVED12_P32          APOLLO5_PINMUX(32,12)
#define FLLOAD_DIR_P32          APOLLO5_PINMUX(32,13)
#define RESERVED14_P32          APOLLO5_PINMUX(32,14)
#define SCANOUT2_P32            APOLLO5_PINMUX(32,15)

#define M4SDAWIR3_P33           APOLLO5_PINMUX(33,0)
#define M4MOSI_P33              APOLLO5_PINMUX(33,1)
#define RESERVED2_P33           APOLLO5_PINMUX(33,2)
#define GPIO_P33                APOLLO5_PINMUX(33,3)
#define TRIG2_P33               APOLLO5_PINMUX(33,4)
#define COEX_PRIORITY_P33       APOLLO5_PINMUX(33,5)
#define CT33_P33                APOLLO5_PINMUX(33,6)
#define NCE33_P33               APOLLO5_PINMUX(33,7)
#define OBSBUS1_P33             APOLLO5_PINMUX(33,8)
#define UART1RX_P33             APOLLO5_PINMUX(33,9)
#define UART0RTS_P33            APOLLO5_PINMUX(33,10)
#define FPIO_P33                APOLLO5_PINMUX(33,11)
#define RESERVED12_P33          APOLLO5_PINMUX(33,12)
#define FLLOAD_ADDR0_P33        APOLLO5_PINMUX(33,13)
#define RESERVED14_P33          APOLLO5_PINMUX(33,14)
#define SCANOUT3_P33            APOLLO5_PINMUX(33,15)

