zephyrproject-rtos/hal_ambiq/dts/apollo510L/ambiq-apollo510L-pinmux.h
#define M4MISO_P34              APOLLO5_PINMUX(34,0)
#define SWO_P34                 APOLLO5_PINMUX(34,1)
#define RESERVED2_P34           APOLLO5_PINMUX(34,2)
#define GPIO_P34                APOLLO5_PINMUX(34,3)
#define TRIG3_P34               APOLLO5_PINMUX(34,4)
#define COEX_FREQ_P34           APOLLO5_PINMUX(34,5)
#define CT34_P34                APOLLO5_PINMUX(34,6)
#define NCE34_P34               APOLLO5_PINMUX(34,7)
#define OBSBUS2_P34             APOLLO5_PINMUX(34,8)
#define UART0TX_P34             APOLLO5_PINMUX(34,9)
#define UART1CTS_P34            APOLLO5_PINMUX(34,10)
#define FPIO_P34                APOLLO5_PINMUX(34,11)
#define RESERVED12_P34          APOLLO5_PINMUX(34,12)
#define FLLOAD_ADDR1_P34        APOLLO5_PINMUX(34,13)
#define RESERVED14_P34          APOLLO5_PINMUX(34,14)
#define SCANOUT4_P34            APOLLO5_PINMUX(34,15)

#define MSPI0_8_P35             APOLLO5_PINMUX(35,0)
#define SWTRACECLK_P35          APOLLO5_PINMUX(35,1)
#define RESERVED2_P35           APOLLO5_PINMUX(35,2)
#define GPIO_P35                APOLLO5_PINMUX(35,3)
#define RESERVED4_P35           APOLLO5_PINMUX(35,4)
#define RESERVED5_P35           APOLLO5_PINMUX(35,5)
#define CT35_P35                APOLLO5_PINMUX(35,6)
#define NCE35_P35               APOLLO5_PINMUX(35,7)
#define OBSBUS3_P35             APOLLO5_PINMUX(35,8)
#define UART0RX_P35             APOLLO5_PINMUX(35,9)
#define UART1RTS_P35            APOLLO5_PINMUX(35,10)
#define FPIO_P35                APOLLO5_PINMUX(35,11)
#define RESERVED12_P35          APOLLO5_PINMUX(35,12)
#define FLLOAD_ADDR2_P35        APOLLO5_PINMUX(35,13)
#define RESERVED14_P35          APOLLO5_PINMUX(35,14)
#define SCANOUT5_P35            APOLLO5_PINMUX(35,15)

#define MSPI0_0_P36             APOLLO5_PINMUX(36,0)
#define SWTRACE0_P36            APOLLO5_PINMUX(36,1)
#define RESERVED2_P36           APOLLO5_PINMUX(36,2)
#define GPIO_P36                APOLLO5_PINMUX(36,3)
#define RESERVED4_P36           APOLLO5_PINMUX(36,4)
#define RESERVED5_P36           APOLLO5_PINMUX(36,5)
#define CT36_P36                APOLLO5_PINMUX(36,6)
#define NCE36_P36               APOLLO5_PINMUX(36,7)
#define OBSBUS4_P36             APOLLO5_PINMUX(36,8)
#define UART1TX_P36             APOLLO5_PINMUX(36,9)
#define UART0CTS_P36            APOLLO5_PINMUX(36,10)
#define FPIO_P36                APOLLO5_PINMUX(36,11)
#define RESERVED12_P36          APOLLO5_PINMUX(36,12)
#define FLLOAD_DATA0_P36        APOLLO5_PINMUX(36,13)
#define RESERVED14_P36          APOLLO5_PINMUX(36,14)
#define SCANOUT6_P36            APOLLO5_PINMUX(36,15)

#define MSPI0_1_P37             APOLLO5_PINMUX(37,0)
#define SWTRACE1_P37            APOLLO5_PINMUX(37,1)
#define RESERVED2_P37           APOLLO5_PINMUX(37,2)
#define GPIO_P37                APOLLO5_PINMUX(37,3)
#define RESERVED4_P37           APOLLO5_PINMUX(37,4)
#define XT32KHz_P37             APOLLO5_PINMUX(37,5)
#define CT37_P37                APOLLO5_PINMUX(37,6)
#define NCE37_P37               APOLLO5_PINMUX(37,7)
#define OBSBUS5_P37             APOLLO5_PINMUX(37,8)
#define UART1RX_P37             APOLLO5_PINMUX(37,9)
#define UART0RTS_P37            APOLLO5_PINMUX(37,10)
#define FPIO_P37                APOLLO5_PINMUX(37,11)
#define RESERVED12_P37          APOLLO5_PINMUX(37,12)
#define FLLOAD_DATA1_P37        APOLLO5_PINMUX(37,13)
#define RESERVED14_P37          APOLLO5_PINMUX(37,14)
#define SCANOUT7_P37            APOLLO5_PINMUX(37,15)

#define MSPI0_2_P38             APOLLO5_PINMUX(38,0)
#define SWTRACE2_P38            APOLLO5_PINMUX(38,1)
#define RESERVED2_P38           APOLLO5_PINMUX(38,2)
#define GPIO_P38                APOLLO5_PINMUX(38,3)
#define RESERVED4_P38           APOLLO5_PINMUX(38,4)
#define RESERVED5_P38           APOLLO5_PINMUX(38,5)
#define CT38_P38                APOLLO5_PINMUX(38,6)
#define NCE38_P38               APOLLO5_PINMUX(38,7)
#define OBSBUS6_P38             APOLLO5_PINMUX(38,8)
#define RESERVED9_P38           APOLLO5_PINMUX(38,9)
#define RESERVED10_P38          APOLLO5_PINMUX(38,10)
#define FPIO_P38                APOLLO5_PINMUX(38,11)
#define RESERVED12_P38          APOLLO5_PINMUX(38,12)
#define FLLOAD_DATA2_P38        APOLLO5_PINMUX(38,13)
#define RESERVED14_P38          APOLLO5_PINMUX(38,14)
#define SCANOUT8_P38            APOLLO5_PINMUX(38,15)

#define MSPI0_3_P39             APOLLO5_PINMUX(39,0)
#define SWTRACE3_P39            APOLLO5_PINMUX(39,1)
#define RESERVED2_P39           APOLLO5_PINMUX(39,2)
#define GPIO_P39                APOLLO5_PINMUX(39,3)
#define RESERVED4_P39           APOLLO5_PINMUX(39,4)
#define RESERVED5_P39           APOLLO5_PINMUX(39,5)
#define CT39_P39                APOLLO5_PINMUX(39,6)
#define NCE39_P39               APOLLO5_PINMUX(39,7)
#define OBSBUS7_P39             APOLLO5_PINMUX(39,8)
#define RESERVED9_P39           APOLLO5_PINMUX(39,9)
#define RESERVED10_P39          APOLLO5_PINMUX(39,10)
#define FPIO_P39                APOLLO5_PINMUX(39,11)
#define RESERVED12_P39          APOLLO5_PINMUX(39,12)
#define FLLOAD_DATA3_P39        APOLLO5_PINMUX(39,13)
#define RESERVED14_P39          APOLLO5_PINMUX(39,14)
#define SCANOUT9_P39            APOLLO5_PINMUX(39,15)

#define MNCE1_0_P40             APOLLO5_PINMUX(40,0)
#define RESERVED1_P40           APOLLO5_PINMUX(40,1)
#define RESERVED2_P40           APOLLO5_PINMUX(40,2)
#define GPIO_P40                APOLLO5_PINMUX(40,3)
#define RESERVED4_P40           APOLLO5_PINMUX(40,4)
#define RESERVED5_P40           APOLLO5_PINMUX(40,5)
#define CT40_P40                APOLLO5_PINMUX(40,6)
#define NCE40_P40               APOLLO5_PINMUX(40,7)
#define OBSBUS8_P40             APOLLO5_PINMUX(40,8)
#define UART1TX_P40             APOLLO5_PINMUX(40,9)
#define UART0CTS_P40            APOLLO5_PINMUX(40,10)
#define FPIO_P40                APOLLO5_PINMUX(40,11)
#define RESERVED12_P40          APOLLO5_PINMUX(40,12)
#define RESERVED13_P40          APOLLO5_PINMUX(40,13)
#define RESERVED14_P40          APOLLO5_PINMUX(40,14)
#define RESERVED15_P40          APOLLO5_PINMUX(40,15)

#define MNCE2_0_P41             APOLLO5_PINMUX(41,0)
#define RESERVED1_P41           APOLLO5_PINMUX(41,1)
#define RESERVED2_P41           APOLLO5_PINMUX(41,2)
#define GPIO_P41                APOLLO5_PINMUX(41,3)
#define RESERVED4_P41           APOLLO5_PINMUX(41,4)
#define RESERVED5_P41           APOLLO5_PINMUX(41,5)
#define CT41_P41                APOLLO5_PINMUX(41,6)
#define NCE41_P41               APOLLO5_PINMUX(41,7)
#define OBSBUS9_P41             APOLLO5_PINMUX(41,8)
#define UART1RX_P41             APOLLO5_PINMUX(41,9)
#define UART0RTS_P41            APOLLO5_PINMUX(41,10)
#define FPIO_P41                APOLLO5_PINMUX(41,11)
#define RESERVED12_P41          APOLLO5_PINMUX(41,12)
#define RESERVED13_P41          APOLLO5_PINMUX(41,13)
#define RESERVED14_P41          APOLLO5_PINMUX(41,14)
#define RESERVED15_P41          APOLLO5_PINMUX(41,15)

#define MNCE1_1_P42             APOLLO5_PINMUX(42,0)
#define DISP_TE_P42             APOLLO5_PINMUX(42,1)
#define RESERVED2_P42           APOLLO5_PINMUX(42,2)
#define GPIO_P42                APOLLO5_PINMUX(42,3)
#define ST_WCI_1W_RXD_P42       APOLLO5_PINMUX(42,4)
#define ST_WCI_2W_TXD_P42       APOLLO5_PINMUX(42,5)
#define CT42_P42                APOLLO5_PINMUX(42,6)
#define NCE42_P42               APOLLO5_PINMUX(42,7)
#define OBSBUS10_P42            APOLLO5_PINMUX(42,8)
#define RESERVED9_P42           APOLLO5_PINMUX(42,9)
#define RESERVED10_P42          APOLLO5_PINMUX(42,10)
#define FPIO_P42                APOLLO5_PINMUX(42,11)
#define BTDM_RXEN_P42           APOLLO5_PINMUX(42,12)
#define RESERVED13_P42          APOLLO5_PINMUX(42,13)
#define RESERVED14_P42          APOLLO5_PINMUX(42,14)
#define RESERVED15_P42          APOLLO5_PINMUX(42,15)

#define CM4_SWDCK_P43           APOLLO5_PINMUX(43,0)
#define SDIF1_DAT4_P43          APOLLO5_PINMUX(43,1)
#define COEX_GRANT_P43          APOLLO5_PINMUX(43,2)
#define GPIO_P43                APOLLO5_PINMUX(43,3)
#define PDMI2S0_SDOUT_P43       APOLLO5_PINMUX(43,4)
#define RESERVED5_P43           APOLLO5_PINMUX(43,5)
#define CT43_P43                APOLLO5_PINMUX(43,6)
#define NCE43_P43               APOLLO5_PINMUX(43,7)
#define OBSBUS11_P43            APOLLO5_PINMUX(43,8)
#define UART1TX_P43             APOLLO5_PINMUX(43,9)
#define UART0CTS_P43            APOLLO5_PINMUX(43,10)
#define FPIO_P43                APOLLO5_PINMUX(43,11)
#define I2S0_SDOUT_P43          APOLLO5_PINMUX(43,12)
#define I2S0_DATA_P43           APOLLO5_PINMUX(43,13)
#define RESERVED14_P43          APOLLO5_PINMUX(43,14)
#define RESERVED15_P43          APOLLO5_PINMUX(43,15)

#define CM4_SWDIO_P44           APOLLO5_PINMUX(44,0)
#define SDIF1_DAT5_P44          APOLLO5_PINMUX(44,1)
#define COEX_REQ_P44            APOLLO5_PINMUX(44,2)
#define GPIO_P44                APOLLO5_PINMUX(44,3)
#define PDMI2S0_WS_P44          APOLLO5_PINMUX(44,4)
#define SWO_P44                 APOLLO5_PINMUX(44,5)
#define CT44_P44                APOLLO5_PINMUX(44,6)
#define NCE44_P44               APOLLO5_PINMUX(44,7)
#define OBSBUS12_P44            APOLLO5_PINMUX(44,8)
#define UART1RX_P44             APOLLO5_PINMUX(44,9)
#define UART0RTS_P44            APOLLO5_PINMUX(44,10)
#define FPIO_P44                APOLLO5_PINMUX(44,11)
#define I2S0_WS_P44             APOLLO5_PINMUX(44,12)
#define RESERVED13_P44          APOLLO5_PINMUX(44,13)
#define RESERVED14_P44          APOLLO5_PINMUX(44,14)
#define RESERVED15_P44          APOLLO5_PINMUX(44,15)

#define CM4_SWO_P45             APOLLO5_PINMUX(45,0)
#define SDIF1_DAT6_P45          APOLLO5_PINMUX(45,1)
#define COEX_PRIORITY_P45       APOLLO5_PINMUX(45,2)
#define GPIO_P45                APOLLO5_PINMUX(45,3)
#define RESERVED4_P45           APOLLO5_PINMUX(45,4)
#define XT32KHz_P45             APOLLO5_PINMUX(45,5)
#define CT45_P45                APOLLO5_PINMUX(45,6)
#define NCE45_P45               APOLLO5_PINMUX(45,7)
#define OBSBUS13_P45            APOLLO5_PINMUX(45,8)
#define UART1TX_P45             APOLLO5_PINMUX(45,9)
#define UART0CTS_P45            APOLLO5_PINMUX(45,10)
#define FPIO_P45                APOLLO5_PINMUX(45,11)
#define I2S0_SDIN_P45           APOLLO5_PINMUX(45,12)
#define RESERVED13_P45          APOLLO5_PINMUX(45,13)
#define RESERVED14_P45          APOLLO5_PINMUX(45,14)
#define RESERVED15_P45          APOLLO5_PINMUX(45,15)

#define I2S0_MCLK_P46           APOLLO5_PINMUX(46,0)
#define SDIF1_DAT7_P46          APOLLO5_PINMUX(46,1)
#define COEX_FREQ_P46           APOLLO5_PINMUX(46,2)
#define GPIO_P46                APOLLO5_PINMUX(46,3)
#define TRIG3_P46               APOLLO5_PINMUX(46,4)
#define SWO_P46                 APOLLO5_PINMUX(46,5)
#define CT46_P46                APOLLO5_PINMUX(46,6)
#define NCE46_P46               APOLLO5_PINMUX(46,7)
#define OBSBUS14_P46            APOLLO5_PINMUX(46,8)
#define UART1RX_P46             APOLLO5_PINMUX(46,9)
#define UART0RTS_P46            APOLLO5_PINMUX(46,10)
#define FPIO_P46                APOLLO5_PINMUX(46,11)
#define RESERVED12_P46          APOLLO5_PINMUX(46,12)
#define RESERVED13_P46          APOLLO5_PINMUX(46,13)
#define RESERVED14_P46          APOLLO5_PINMUX(46,14)
#define RESERVED15_P46          APOLLO5_PINMUX(46,15)

#define MSPI1_4_P47             APOLLO5_PINMUX(47,0)
#define SWTRACECLK_P47          APOLLO5_PINMUX(47,1)
#define CLKOUT_P47              APOLLO5_PINMUX(47,2)
#define GPIO_P47                APOLLO5_PINMUX(47,3)
#define TRIG0_P47               APOLLO5_PINMUX(47,4)
#define RESERVED5_P47           APOLLO5_PINMUX(47,5)
#define CT47_P47                APOLLO5_PINMUX(47,6)
#define NCE47_P47               APOLLO5_PINMUX(47,7)
#define OBSBUS15_P47            APOLLO5_PINMUX(47,8)
#define RESERVED9_P47           APOLLO5_PINMUX(47,9)
#define RESERVED10_P47          APOLLO5_PINMUX(47,10)
#define FPIO_P47                APOLLO5_PINMUX(47,11)
#define RESERVED12_P47          APOLLO5_PINMUX(47,12)
#define RESERVED13_P47          APOLLO5_PINMUX(47,13)
#define RESERVED14_P47          APOLLO5_PINMUX(47,14)
#define RESERVED15_P47          APOLLO5_PINMUX(47,15)

