zephyrproject-rtos/hal_ambiq/dts/apollo510L/ambiq-apollo510L-pinmux.h
#define MSPI1_0_P48             APOLLO5_PINMUX(48,0)
#define SWTRACE0_P48            APOLLO5_PINMUX(48,1)
#define CLKOUT_P48              APOLLO5_PINMUX(48,2)
#define GPIO_P48                APOLLO5_PINMUX(48,3)
#define TRIG1_P48               APOLLO5_PINMUX(48,4)
#define RESERVED5_P48           APOLLO5_PINMUX(48,5)
#define CT48_P48                APOLLO5_PINMUX(48,6)
#define NCE48_P48               APOLLO5_PINMUX(48,7)
#define OBSBUS0_P48             APOLLO5_PINMUX(48,8)
#define UART0TX_P48             APOLLO5_PINMUX(48,9)
#define UART1CTS_P48            APOLLO5_PINMUX(48,10)
#define FPIO_P48                APOLLO5_PINMUX(48,11)
#define RESERVED12_P48          APOLLO5_PINMUX(48,12)
#define RESERVED13_P48          APOLLO5_PINMUX(48,13)
#define RESERVED14_P48          APOLLO5_PINMUX(48,14)
#define RESERVED15_P48          APOLLO5_PINMUX(48,15)

#define MSPI1_1_P49             APOLLO5_PINMUX(49,0)
#define SWTRACE1_P49            APOLLO5_PINMUX(49,1)
#define RESERVED2_P49           APOLLO5_PINMUX(49,2)
#define GPIO_P49                APOLLO5_PINMUX(49,3)
#define TRIG2_P49               APOLLO5_PINMUX(49,4)
#define RESERVED5_P49           APOLLO5_PINMUX(49,5)
#define CT49_P49                APOLLO5_PINMUX(49,6)
#define NCE49_P49               APOLLO5_PINMUX(49,7)
#define OBSBUS1_P49             APOLLO5_PINMUX(49,8)
#define UART0RX_P49             APOLLO5_PINMUX(49,9)
#define UART1RTS_P49            APOLLO5_PINMUX(49,10)
#define FPIO_P49                APOLLO5_PINMUX(49,11)
#define RESERVED12_P49          APOLLO5_PINMUX(49,12)
#define RESERVED13_P49          APOLLO5_PINMUX(49,13)
#define RESERVED14_P49          APOLLO5_PINMUX(49,14)
#define RESERVED15_P49          APOLLO5_PINMUX(49,15)

#define MSPI1_2_P50             APOLLO5_PINMUX(50,0)
#define SWTRACE2_P50            APOLLO5_PINMUX(50,1)
#define RESERVED2_P50           APOLLO5_PINMUX(50,2)
#define GPIO_P50                APOLLO5_PINMUX(50,3)
#define TRIG3_P50               APOLLO5_PINMUX(50,4)
#define RESERVED5_P50           APOLLO5_PINMUX(50,5)
#define CT50_P50                APOLLO5_PINMUX(50,6)
#define NCE50_P50               APOLLO5_PINMUX(50,7)
#define OBSBUS2_P50             APOLLO5_PINMUX(50,8)
#define UART1TX_P50             APOLLO5_PINMUX(50,9)
#define UART0CTS_P50            APOLLO5_PINMUX(50,10)
#define FPIO_P50                APOLLO5_PINMUX(50,11)
#define RESERVED12_P50          APOLLO5_PINMUX(50,12)
#define RESERVED13_P50          APOLLO5_PINMUX(50,13)
#define RESERVED14_P50          APOLLO5_PINMUX(50,14)
#define RESERVED15_P50          APOLLO5_PINMUX(50,15)

#define MSPI1_3_P51             APOLLO5_PINMUX(51,0)
#define SWTRACE3_P51            APOLLO5_PINMUX(51,1)
#define RESERVED2_P51           APOLLO5_PINMUX(51,2)
#define GPIO_P51                APOLLO5_PINMUX(51,3)
#define TRIG0_P51               APOLLO5_PINMUX(51,4)
#define RESERVED5_P51           APOLLO5_PINMUX(51,5)
#define CT51_P51                APOLLO5_PINMUX(51,6)
#define NCE51_P51               APOLLO5_PINMUX(51,7)
#define OBSBUS3_P51             APOLLO5_PINMUX(51,8)
#define UART1RX_P51             APOLLO5_PINMUX(51,9)
#define UART0RTS_P51            APOLLO5_PINMUX(51,10)
#define FPIO_P51                APOLLO5_PINMUX(51,11)
#define RESERVED12_P51          APOLLO5_PINMUX(51,12)
#define RESERVED13_P51          APOLLO5_PINMUX(51,13)
#define RESERVED14_P51          APOLLO5_PINMUX(51,14)
#define RESERVED15_P51          APOLLO5_PINMUX(51,15)

#define MSPI1_5_P52             APOLLO5_PINMUX(52,0)
#define SWTRACECTL_P52          APOLLO5_PINMUX(52,1)
#define CLKOUT_P52              APOLLO5_PINMUX(52,2)
#define GPIO_P52                APOLLO5_PINMUX(52,3)
#define TRIG1_P52               APOLLO5_PINMUX(52,4)
#define RESERVED5_P52           APOLLO5_PINMUX(52,5)
#define CT52_P52                APOLLO5_PINMUX(52,6)
#define NCE52_P52               APOLLO5_PINMUX(52,7)
#define OBSBUS4_P52             APOLLO5_PINMUX(52,8)
#define UART0TX_P52             APOLLO5_PINMUX(52,9)
#define UART1CTS_P52            APOLLO5_PINMUX(52,10)
#define FPIO_P52                APOLLO5_PINMUX(52,11)
#define RESERVED12_P52          APOLLO5_PINMUX(52,12)
#define RESERVED13_P52          APOLLO5_PINMUX(52,13)
#define RESERVED14_P52          APOLLO5_PINMUX(52,14)
#define RESERVED15_P52          APOLLO5_PINMUX(52,15)

#define MSPI2_8_P53             APOLLO5_PINMUX(53,0)
#define RESERVED1_P53           APOLLO5_PINMUX(53,1)
#define RESERVED2_P53           APOLLO5_PINMUX(53,2)
#define GPIO_P53                APOLLO5_PINMUX(53,3)
#define RESERVED4_P53           APOLLO5_PINMUX(53,4)
#define SWO_P53                 APOLLO5_PINMUX(53,5)
#define CT53_P53                APOLLO5_PINMUX(53,6)
#define NCE53_P53               APOLLO5_PINMUX(53,7)
#define OBSBUS5_P53             APOLLO5_PINMUX(53,8)
#define UART0RX_P53             APOLLO5_PINMUX(53,9)
#define UART1RTS_P53            APOLLO5_PINMUX(53,10)
#define FPIO_P53                APOLLO5_PINMUX(53,11)
#define RESERVED12_P53          APOLLO5_PINMUX(53,12)
#define RESERVED13_P53          APOLLO5_PINMUX(53,13)
#define RESERVED14_P53          APOLLO5_PINMUX(53,14)
#define RESERVED15_P53          APOLLO5_PINMUX(53,15)

#define MSPI2_0_P54             APOLLO5_PINMUX(54,0)
#define RESERVED1_P54           APOLLO5_PINMUX(54,1)
#define XT32KHz_P54             APOLLO5_PINMUX(54,2)
#define GPIO_P54                APOLLO5_PINMUX(54,3)
#define RESERVED4_P54           APOLLO5_PINMUX(54,4)
#define RESERVED5_P54           APOLLO5_PINMUX(54,5)
#define CT54_P54                APOLLO5_PINMUX(54,6)
#define NCE54_P54               APOLLO5_PINMUX(54,7)
#define OBSBUS6_P54             APOLLO5_PINMUX(54,8)
#define UART1TX_P54             APOLLO5_PINMUX(54,9)
#define UART0CTS_P54            APOLLO5_PINMUX(54,10)
#define FPIO_P54                APOLLO5_PINMUX(54,11)
#define RESERVED12_P54          APOLLO5_PINMUX(54,12)
#define RESERVED13_P54          APOLLO5_PINMUX(54,13)
#define RESERVED14_P54          APOLLO5_PINMUX(54,14)
#define RESERVED15_P54          APOLLO5_PINMUX(54,15)

#define MSPI2_1_P55             APOLLO5_PINMUX(55,0)
#define RESERVED1_P55           APOLLO5_PINMUX(55,1)
#define XT32KHz_P55             APOLLO5_PINMUX(55,2)
#define GPIO_P55                APOLLO5_PINMUX(55,3)
#define RESERVED4_P55           APOLLO5_PINMUX(55,4)
#define RESERVED5_P55           APOLLO5_PINMUX(55,5)
#define CT55_P55                APOLLO5_PINMUX(55,6)
#define NCE55_P55               APOLLO5_PINMUX(55,7)
#define OBSBUS7_P55             APOLLO5_PINMUX(55,8)
#define UART1RX_P55             APOLLO5_PINMUX(55,9)
#define UART0RTS_P55            APOLLO5_PINMUX(55,10)
#define FPIO_P55                APOLLO5_PINMUX(55,11)
#define RESERVED12_P55          APOLLO5_PINMUX(55,12)
#define RESERVED13_P55          APOLLO5_PINMUX(55,13)
#define RESERVED14_P55          APOLLO5_PINMUX(55,14)
#define RESERVED15_P55          APOLLO5_PINMUX(55,15)

#define MSPI2_2_P56             APOLLO5_PINMUX(56,0)
#define RESERVED1_P56           APOLLO5_PINMUX(56,1)
#define CLKOUT_P56              APOLLO5_PINMUX(56,2)
#define GPIO_P56                APOLLO5_PINMUX(56,3)
#define RESERVED4_P56           APOLLO5_PINMUX(56,4)
#define RESERVED5_P56           APOLLO5_PINMUX(56,5)
#define CT56_P56                APOLLO5_PINMUX(56,6)
#define NCE56_P56               APOLLO5_PINMUX(56,7)
#define OBSBUS8_P56             APOLLO5_PINMUX(56,8)
#define UART0TX_P56             APOLLO5_PINMUX(56,9)
#define UART1CTS_P56            APOLLO5_PINMUX(56,10)
#define FPIO_P56                APOLLO5_PINMUX(56,11)
#define RESERVED12_P56          APOLLO5_PINMUX(56,12)
#define RESERVED13_P56          APOLLO5_PINMUX(56,13)
#define RESERVED14_P56          APOLLO5_PINMUX(56,14)
#define RESERVED15_P56          APOLLO5_PINMUX(56,15)

#define MSPI2_3_P57             APOLLO5_PINMUX(57,0)
#define RESERVED1_P57           APOLLO5_PINMUX(57,1)
#define CLKOUT_P57              APOLLO5_PINMUX(57,2)
#define GPIO_P57                APOLLO5_PINMUX(57,3)
#define RESERVED4_P57           APOLLO5_PINMUX(57,4)
#define RESERVED5_P57           APOLLO5_PINMUX(57,5)
#define CT57_P57                APOLLO5_PINMUX(57,6)
#define NCE57_P57               APOLLO5_PINMUX(57,7)
#define OBSBUS9_P57             APOLLO5_PINMUX(57,8)
#define UART0RX_P57             APOLLO5_PINMUX(57,9)
#define UART1RTS_P57            APOLLO5_PINMUX(57,10)
#define FPIO_P57                APOLLO5_PINMUX(57,11)
#define RESERVED12_P57          APOLLO5_PINMUX(57,12)
#define RESERVED13_P57          APOLLO5_PINMUX(57,13)
#define RESERVED14_P57          APOLLO5_PINMUX(57,14)
#define RESERVED15_P57          APOLLO5_PINMUX(57,15)

