zephyrproject-rtos/hal_ambiq/dts/apollo510L/ambiq-apollo510L-pinmux.h
#define MSPI0_11_P70            APOLLO5_PINMUX(70,0)
#define SWTRACE0_P70            APOLLO5_PINMUX(70,1)
#define RESERVED2_P70           APOLLO5_PINMUX(70,2)
#define GPIO_P70                APOLLO5_PINMUX(70,3)
#define MSPI2_1_P70             APOLLO5_PINMUX(70,4)
#define COEX_GRANT_P70          APOLLO5_PINMUX(70,5)
#define CT70_P70                APOLLO5_PINMUX(70,6)
#define NCE70_P70               APOLLO5_PINMUX(70,7)
#define OBSBUS6_P70             APOLLO5_PINMUX(70,8)
#define UART1TX_P70             APOLLO5_PINMUX(70,9)
#define UART0CTS_P70            APOLLO5_PINMUX(70,10)
#define FPIO_P70                APOLLO5_PINMUX(70,11)
#define RESERVED12_P70          APOLLO5_PINMUX(70,12)
#define RESERVED13_P70          APOLLO5_PINMUX(70,13)
#define RESERVED14_P70          APOLLO5_PINMUX(70,14)
#define RESERVED15_P70          APOLLO5_PINMUX(70,15)

#define MSPI0_12_P71            APOLLO5_PINMUX(71,0)
#define SWTRACE1_P71            APOLLO5_PINMUX(71,1)
#define RESERVED2_P71           APOLLO5_PINMUX(71,2)
#define GPIO_P71                APOLLO5_PINMUX(71,3)
#define MSPI2_2_P71             APOLLO5_PINMUX(71,4)
#define COEX_REQ_P71            APOLLO5_PINMUX(71,5)
#define CT71_P71                APOLLO5_PINMUX(71,6)
#define NCE71_P71               APOLLO5_PINMUX(71,7)
#define OBSBUS7_P71             APOLLO5_PINMUX(71,8)
#define UART1RX_P71             APOLLO5_PINMUX(71,9)
#define UART0RTS_P71            APOLLO5_PINMUX(71,10)
#define FPIO_P71                APOLLO5_PINMUX(71,11)
#define RESERVED12_P71          APOLLO5_PINMUX(71,12)
#define RESERVED13_P71          APOLLO5_PINMUX(71,13)
#define RESERVED14_P71          APOLLO5_PINMUX(71,14)
#define RESERVED15_P71          APOLLO5_PINMUX(71,15)

#define MSPI0_13_P72            APOLLO5_PINMUX(72,0)
#define SWTRACE2_P72            APOLLO5_PINMUX(72,1)
#define RESERVED2_P72           APOLLO5_PINMUX(72,2)
#define GPIO_P72                APOLLO5_PINMUX(72,3)
#define MSPI2_3_P72             APOLLO5_PINMUX(72,4)
#define COEX_PRIORITY_P72       APOLLO5_PINMUX(72,5)
#define CT72_P72                APOLLO5_PINMUX(72,6)
#define NCE72_P72               APOLLO5_PINMUX(72,7)
#define OBSBUS8_P72             APOLLO5_PINMUX(72,8)
#define UART0TX_P72             APOLLO5_PINMUX(72,9)
#define UART1CTS_P72            APOLLO5_PINMUX(72,10)
#define FPIO_P72                APOLLO5_PINMUX(72,11)
#define RESERVED12_P72          APOLLO5_PINMUX(72,12)
#define RESERVED13_P72          APOLLO5_PINMUX(72,13)
#define RESERVED14_P72          APOLLO5_PINMUX(72,14)
#define RESERVED15_P72          APOLLO5_PINMUX(72,15)

#define MSPI0_14_P73            APOLLO5_PINMUX(73,0)
#define SWTRACE3_P73            APOLLO5_PINMUX(73,1)
#define RESERVED2_P73           APOLLO5_PINMUX(73,2)
#define GPIO_P73                APOLLO5_PINMUX(73,3)
#define MSPI2_4_P73             APOLLO5_PINMUX(73,4)
#define COEX_FREQ_P73           APOLLO5_PINMUX(73,5)
#define CT73_P73                APOLLO5_PINMUX(73,6)
#define NCE73_P73               APOLLO5_PINMUX(73,7)
#define OBSBUS9_P73             APOLLO5_PINMUX(73,8)
#define UART0RX_P73             APOLLO5_PINMUX(73,9)
#define UART1RTS_P73            APOLLO5_PINMUX(73,10)
#define FPIO_P73                APOLLO5_PINMUX(73,11)
#define RESERVED12_P73          APOLLO5_PINMUX(73,12)
#define RESERVED13_P73          APOLLO5_PINMUX(73,13)
#define RESERVED14_P73          APOLLO5_PINMUX(73,14)
#define RESERVED15_P73          APOLLO5_PINMUX(73,15)

#define MSPI0_15_P74            APOLLO5_PINMUX(74,0)
#define RESERVED1_P74           APOLLO5_PINMUX(74,1)
#define RESERVED2_P74           APOLLO5_PINMUX(74,2)
#define GPIO_P74                APOLLO5_PINMUX(74,3)
#define MSPI2_5_P74             APOLLO5_PINMUX(74,4)
#define RESERVED5_P74           APOLLO5_PINMUX(74,5)
#define CT74_P74                APOLLO5_PINMUX(74,6)
#define NCE74_P74               APOLLO5_PINMUX(74,7)
#define OBSBUS10_P74            APOLLO5_PINMUX(74,8)
#define UART1TX_P74             APOLLO5_PINMUX(74,9)
#define UART0CTS_P74            APOLLO5_PINMUX(74,10)
#define FPIO_P74                APOLLO5_PINMUX(74,11)
#define RESERVED12_P74          APOLLO5_PINMUX(74,12)
#define RESERVED13_P74          APOLLO5_PINMUX(74,13)
#define RESERVED14_P74          APOLLO5_PINMUX(74,14)
#define RESERVED15_P74          APOLLO5_PINMUX(74,15)

#define MSPI0_16_P75            APOLLO5_PINMUX(75,0)
#define RESERVED1_P75           APOLLO5_PINMUX(75,1)
#define CLKOUT_P75              APOLLO5_PINMUX(75,2)
#define GPIO_P75                APOLLO5_PINMUX(75,3)
#define MSPI2_6_P75             APOLLO5_PINMUX(75,4)
#define RESERVED5_P75           APOLLO5_PINMUX(75,5)
#define CT75_P75                APOLLO5_PINMUX(75,6)
#define NCE75_P75               APOLLO5_PINMUX(75,7)
#define OBSBUS11_P75            APOLLO5_PINMUX(75,8)
#define UART1RX_P75             APOLLO5_PINMUX(75,9)
#define UART0RTS_P75            APOLLO5_PINMUX(75,10)
#define FPIO_P75                APOLLO5_PINMUX(75,11)
#define RESERVED12_P75          APOLLO5_PINMUX(75,12)
#define RESERVED13_P75          APOLLO5_PINMUX(75,13)
#define RESERVED14_P75          APOLLO5_PINMUX(75,14)
#define RESERVED15_P75          APOLLO5_PINMUX(75,15)

#define MSPI0_17_P76            APOLLO5_PINMUX(76,0)
#define RESERVED1_P76           APOLLO5_PINMUX(76,1)
#define CLKOUT_P76              APOLLO5_PINMUX(76,2)
#define GPIO_P76                APOLLO5_PINMUX(76,3)
#define MSPI2_7_P76             APOLLO5_PINMUX(76,4)
#define RESERVED5_P76           APOLLO5_PINMUX(76,5)
#define CT76_P76                APOLLO5_PINMUX(76,6)
#define NCE76_P76               APOLLO5_PINMUX(76,7)
#define OBSBUS12_P76            APOLLO5_PINMUX(76,8)
#define UART0TX_P76             APOLLO5_PINMUX(76,9)
#define UART1CTS_P76            APOLLO5_PINMUX(76,10)
#define FPIO_P76                APOLLO5_PINMUX(76,11)
#define RESERVED12_P76          APOLLO5_PINMUX(76,12)
#define RESERVED13_P76          APOLLO5_PINMUX(76,13)
#define RESERVED14_P76          APOLLO5_PINMUX(76,14)
#define RESERVED15_P76          APOLLO5_PINMUX(76,15)

#define MSPI0_18_P77            APOLLO5_PINMUX(77,0)
#define RESERVED1_P77           APOLLO5_PINMUX(77,1)
#define XT32KHz_P77             APOLLO5_PINMUX(77,2)
#define GPIO_P77                APOLLO5_PINMUX(77,3)
#define MSPI2_9_P77             APOLLO5_PINMUX(77,4)
#define RESERVED5_P77           APOLLO5_PINMUX(77,5)
#define CT77_P77                APOLLO5_PINMUX(77,6)
#define NCE77_P77               APOLLO5_PINMUX(77,7)
#define OBSBUS13_P77            APOLLO5_PINMUX(77,8)
#define UART0RX_P77             APOLLO5_PINMUX(77,9)
#define UART1RTS_P77            APOLLO5_PINMUX(77,10)
#define FPIO_P77                APOLLO5_PINMUX(77,11)
#define RESERVED12_P77          APOLLO5_PINMUX(77,12)
#define RESERVED13_P77          APOLLO5_PINMUX(77,13)
#define RESERVED14_P77          APOLLO5_PINMUX(77,14)
#define RESERVED15_P77          APOLLO5_PINMUX(77,15)

#define MNCE0_0_P78             APOLLO5_PINMUX(78,0)
#define RESERVED1_P78           APOLLO5_PINMUX(78,1)
#define RESERVED2_P78           APOLLO5_PINMUX(78,2)
#define GPIO_P78                APOLLO5_PINMUX(78,3)
#define RESERVED4_P78           APOLLO5_PINMUX(78,4)
#define RESERVED5_P78           APOLLO5_PINMUX(78,5)
#define CT78_P78                APOLLO5_PINMUX(78,6)
#define NCE78_P78               APOLLO5_PINMUX(78,7)
#define OBSBUS14_P78            APOLLO5_PINMUX(78,8)
#define UART1TX_P78             APOLLO5_PINMUX(78,9)
#define UART0CTS_P78            APOLLO5_PINMUX(78,10)
#define FPIO_P78                APOLLO5_PINMUX(78,11)
#define RESERVED12_P78          APOLLO5_PINMUX(78,12)
#define RESERVED13_P78          APOLLO5_PINMUX(78,13)
#define RESERVED14_P78          APOLLO5_PINMUX(78,14)
#define RESERVED15_P78          APOLLO5_PINMUX(78,15)

#define MNCE0_1_P79             APOLLO5_PINMUX(79,0)
#define DISP_TE_P79             APOLLO5_PINMUX(79,1)
#define ST_WCI_2W_TXD_P79       APOLLO5_PINMUX(79,2)
#define GPIO_P79                APOLLO5_PINMUX(79,3)
#define ST_WCI_1W_RXD_P79       APOLLO5_PINMUX(79,4)
#define RESERVED5_P79           APOLLO5_PINMUX(79,5)
#define CT79_P79                APOLLO5_PINMUX(79,6)
#define NCE79_P79               APOLLO5_PINMUX(79,7)
#define OBSBUS15_P79            APOLLO5_PINMUX(79,8)
#define UART1RX_P79             APOLLO5_PINMUX(79,9)
#define UART0RTS_P79            APOLLO5_PINMUX(79,10)
#define FPIO_P79                APOLLO5_PINMUX(79,11)
#define BTDM_TXEN_P79           APOLLO5_PINMUX(79,12)
#define RESERVED13_P79          APOLLO5_PINMUX(79,13)
#define RESERVED14_P79          APOLLO5_PINMUX(79,14)
#define RESERVED15_P79          APOLLO5_PINMUX(79,15)

#define MNCE2_1_P80             APOLLO5_PINMUX(80,0)
#define DISP_TE_P80             APOLLO5_PINMUX(80,1)
#define ST_WCI_2W_TXD_P80       APOLLO5_PINMUX(80,2)
#define GPIO_P80                APOLLO5_PINMUX(80,3)
#define ST_WCI_1W_RXD_P80       APOLLO5_PINMUX(80,4)
#define RESERVED5_P80           APOLLO5_PINMUX(80,5)
#define CT80_P80                APOLLO5_PINMUX(80,6)
#define NCE80_P80               APOLLO5_PINMUX(80,7)
#define OBSBUS0_P80             APOLLO5_PINMUX(80,8)
#define UART0TX_P80             APOLLO5_PINMUX(80,9)
#define UART1CTS_P80            APOLLO5_PINMUX(80,10)
#define FPIO_P80                APOLLO5_PINMUX(80,11)
#define RESERVED12_P80          APOLLO5_PINMUX(80,12)
#define RESERVED13_P80          APOLLO5_PINMUX(80,13)
#define RESERVED14_P80          APOLLO5_PINMUX(80,14)
#define RESERVED15_P80          APOLLO5_PINMUX(80,15)

