zephyrproject-rtos/hal_ambiq/dts/apollo510L/ambiq-apollo510L-pinmux.h
#define MSPI0_9_P81             APOLLO5_PINMUX(81,0)
#define RESERVED1_P81           APOLLO5_PINMUX(81,1)
#define RESERVED2_P81           APOLLO5_PINMUX(81,2)
#define GPIO_P81                APOLLO5_PINMUX(81,3)
#define RESERVED4_P81           APOLLO5_PINMUX(81,4)
#define RESERVED5_P81           APOLLO5_PINMUX(81,5)
#define CT81_P81                APOLLO5_PINMUX(81,6)
#define NCE81_P81               APOLLO5_PINMUX(81,7)
#define OBSBUS1_P81             APOLLO5_PINMUX(81,8)
#define UART0RX_P81             APOLLO5_PINMUX(81,9)
#define UART1RTS_P81            APOLLO5_PINMUX(81,10)
#define FPIO_P81                APOLLO5_PINMUX(81,11)
#define RESERVED12_P81          APOLLO5_PINMUX(81,12)
#define RESERVED13_P81          APOLLO5_PINMUX(81,13)
#define RESERVED14_P81          APOLLO5_PINMUX(81,14)
#define RESERVED15_P81          APOLLO5_PINMUX(81,15)

#define SDIF0_CLKOUT_P82        APOLLO5_PINMUX(82,0)
#define RESERVED1_P82           APOLLO5_PINMUX(82,1)
#define RESERVED2_P82           APOLLO5_PINMUX(82,2)
#define GPIO_P82                APOLLO5_PINMUX(82,3)
#define TRIG0_P82               APOLLO5_PINMUX(82,4)
#define RESERVED5_P82           APOLLO5_PINMUX(82,5)
#define CT82_P82                APOLLO5_PINMUX(82,6)
#define NCE82_P82               APOLLO5_PINMUX(82,7)
#define OBSBUS2_P82             APOLLO5_PINMUX(82,8)
#define UART1TX_P82             APOLLO5_PINMUX(82,9)
#define UART0CTS_P82            APOLLO5_PINMUX(82,10)
#define FPIO_P82                APOLLO5_PINMUX(82,11)
#define RESERVED12_P82          APOLLO5_PINMUX(82,12)
#define RESERVED13_P82          APOLLO5_PINMUX(82,13)
#define RESERVED14_P82          APOLLO5_PINMUX(82,14)
#define RESERVED15_P82          APOLLO5_PINMUX(82,15)

#define SDIF0_DAT0_P83          APOLLO5_PINMUX(83,0)
#define RESERVED1_P83           APOLLO5_PINMUX(83,1)
#define RESERVED2_P83           APOLLO5_PINMUX(83,2)
#define GPIO_P83                APOLLO5_PINMUX(83,3)
#define TRIG1_P83               APOLLO5_PINMUX(83,4)
#define RESERVED5_P83           APOLLO5_PINMUX(83,5)
#define CT83_P83                APOLLO5_PINMUX(83,6)
#define NCE83_P83               APOLLO5_PINMUX(83,7)
#define OBSBUS3_P83             APOLLO5_PINMUX(83,8)
#define UART1RX_P83             APOLLO5_PINMUX(83,9)
#define UART0RTS_P83            APOLLO5_PINMUX(83,10)
#define FPIO_P83                APOLLO5_PINMUX(83,11)
#define RESERVED12_P83          APOLLO5_PINMUX(83,12)
#define RESERVED13_P83          APOLLO5_PINMUX(83,13)
#define RESERVED14_P83          APOLLO5_PINMUX(83,14)
#define RESERVED15_P83          APOLLO5_PINMUX(83,15)

#define SDIF0_DAT1_P84          APOLLO5_PINMUX(84,0)
#define RESERVED1_P84           APOLLO5_PINMUX(84,1)
#define RESERVED2_P84           APOLLO5_PINMUX(84,2)
#define GPIO_P84                APOLLO5_PINMUX(84,3)
#define TRIG2_P84               APOLLO5_PINMUX(84,4)
#define RESERVED5_P84           APOLLO5_PINMUX(84,5)
#define CT84_P84                APOLLO5_PINMUX(84,6)
#define NCE84_P84               APOLLO5_PINMUX(84,7)
#define OBSBUS4_P84             APOLLO5_PINMUX(84,8)
#define UART0TX_P84             APOLLO5_PINMUX(84,9)
#define UART1CTS_P84            APOLLO5_PINMUX(84,10)
#define FPIO_P84                APOLLO5_PINMUX(84,11)
#define RESERVED12_P84          APOLLO5_PINMUX(84,12)
#define RESERVED13_P84          APOLLO5_PINMUX(84,13)
#define RESERVED14_P84          APOLLO5_PINMUX(84,14)
#define RESERVED15_P84          APOLLO5_PINMUX(84,15)

#define SDIF0_DAT2_P85          APOLLO5_PINMUX(85,0)
#define RESERVED1_P85           APOLLO5_PINMUX(85,1)
#define RESERVED2_P85           APOLLO5_PINMUX(85,2)
#define GPIO_P85                APOLLO5_PINMUX(85,3)
#define TRIG3_P85               APOLLO5_PINMUX(85,4)
#define RESERVED5_P85           APOLLO5_PINMUX(85,5)
#define CT85_P85                APOLLO5_PINMUX(85,6)
#define NCE85_P85               APOLLO5_PINMUX(85,7)
#define OBSBUS5_P85             APOLLO5_PINMUX(85,8)
#define UART0RX_P85             APOLLO5_PINMUX(85,9)
#define UART1RTS_P85            APOLLO5_PINMUX(85,10)
#define FPIO_P85                APOLLO5_PINMUX(85,11)
#define RESERVED12_P85          APOLLO5_PINMUX(85,12)
#define RESERVED13_P85          APOLLO5_PINMUX(85,13)
#define RESERVED14_P85          APOLLO5_PINMUX(85,14)
#define RESERVED15_P85          APOLLO5_PINMUX(85,15)

#define SDIF0_DAT3_P86          APOLLO5_PINMUX(86,0)
#define RESERVED1_P86           APOLLO5_PINMUX(86,1)
#define RESERVED2_P86           APOLLO5_PINMUX(86,2)
#define GPIO_P86                APOLLO5_PINMUX(86,3)
#define TRIG0_P86               APOLLO5_PINMUX(86,4)
#define RESERVED5_P86           APOLLO5_PINMUX(86,5)
#define CT86_P86                APOLLO5_PINMUX(86,6)
#define NCE86_P86               APOLLO5_PINMUX(86,7)
#define OBSBUS6_P86             APOLLO5_PINMUX(86,8)
#define UART1TX_P86             APOLLO5_PINMUX(86,9)
#define UART0CTS_P86            APOLLO5_PINMUX(86,10)
#define FPIO_P86                APOLLO5_PINMUX(86,11)
#define RESERVED12_P86          APOLLO5_PINMUX(86,12)
#define RESERVED13_P86          APOLLO5_PINMUX(86,13)
#define RESERVED14_P86          APOLLO5_PINMUX(86,14)
#define RESERVED15_P86          APOLLO5_PINMUX(86,15)

#define SDIF0_CMD_P87           APOLLO5_PINMUX(87,0)
#define RESERVED1_P87           APOLLO5_PINMUX(87,1)
#define RESERVED2_P87           APOLLO5_PINMUX(87,2)
#define GPIO_P87                APOLLO5_PINMUX(87,3)
#define TRIG1_P87               APOLLO5_PINMUX(87,4)
#define RESERVED5_P87           APOLLO5_PINMUX(87,5)
#define CT87_P87                APOLLO5_PINMUX(87,6)
#define NCE87_P87               APOLLO5_PINMUX(87,7)
#define OBSBUS7_P87             APOLLO5_PINMUX(87,8)
#define UART1RX_P87             APOLLO5_PINMUX(87,9)
#define UART0RTS_P87            APOLLO5_PINMUX(87,10)
#define FPIO_P87                APOLLO5_PINMUX(87,11)
#define RESERVED12_P87          APOLLO5_PINMUX(87,12)
#define RESERVED13_P87          APOLLO5_PINMUX(87,13)
#define RESERVED14_P87          APOLLO5_PINMUX(87,14)
#define RESERVED15_P87          APOLLO5_PINMUX(87,15)

#define DISP_ENB_P88            APOLLO5_PINMUX(88,0)
#define RESERVED1_P88           APOLLO5_PINMUX(88,1)
#define XT32KHz_P88             APOLLO5_PINMUX(88,2)
#define GPIO_P88                APOLLO5_PINMUX(88,3)
#define TRIG2_P88               APOLLO5_PINMUX(88,4)
#define COEX_GRANT_P88          APOLLO5_PINMUX(88,5)
#define CT88_P88                APOLLO5_PINMUX(88,6)
#define NCE88_P88               APOLLO5_PINMUX(88,7)
#define OBSBUS8_P88             APOLLO5_PINMUX(88,8)
#define UART0TX_P88             APOLLO5_PINMUX(88,9)
#define UART1CTS_P88            APOLLO5_PINMUX(88,10)
#define FPIO_P88                APOLLO5_PINMUX(88,11)
#define CM4_SWDCK_P88           APOLLO5_PINMUX(88,12)
#define DBIB_CSX_P88            APOLLO5_PINMUX(88,13)
#define RESERVED14_P88          APOLLO5_PINMUX(88,14)
#define RESERVED15_P88          APOLLO5_PINMUX(88,15)

#define DISP_XRST_P89           APOLLO5_PINMUX(89,0)
#define RESERVED1_P89           APOLLO5_PINMUX(89,1)
#define RESERVED2_P89           APOLLO5_PINMUX(89,2)
#define GPIO_P89                APOLLO5_PINMUX(89,3)
#define TRIG3_P89               APOLLO5_PINMUX(89,4)
#define COEX_REQ_P89            APOLLO5_PINMUX(89,5)
#define CT89_P89                APOLLO5_PINMUX(89,6)
#define NCE89_P89               APOLLO5_PINMUX(89,7)
#define OBSBUS9_P89             APOLLO5_PINMUX(89,8)
#define UART0RX_P89             APOLLO5_PINMUX(89,9)
#define UART1RTS_P89            APOLLO5_PINMUX(89,10)
#define FPIO_P89                APOLLO5_PINMUX(89,11)
#define CM4_SWDIO_P89           APOLLO5_PINMUX(89,12)
#define DBIB_DCX_P89            APOLLO5_PINMUX(89,13)
#define RESERVED14_P89          APOLLO5_PINMUX(89,14)
#define RESERVED15_P89          APOLLO5_PINMUX(89,15)

#define DISP_R1_P90             APOLLO5_PINMUX(90,0)
#define RESERVED1_P90           APOLLO5_PINMUX(90,1)
#define CLKOUT_P90              APOLLO5_PINMUX(90,2)
#define GPIO_P90                APOLLO5_PINMUX(90,3)
#define TRIG0_P90               APOLLO5_PINMUX(90,4)
#define COEX_PRIORITY_P90       APOLLO5_PINMUX(90,5)
#define CT90_P90                APOLLO5_PINMUX(90,6)
#define NCE90_P90               APOLLO5_PINMUX(90,7)
#define OBSBUS10_P90            APOLLO5_PINMUX(90,8)
#define UART1TX_P90             APOLLO5_PINMUX(90,9)
#define UART0CTS_P90            APOLLO5_PINMUX(90,10)
#define FPIO_P90                APOLLO5_PINMUX(90,11)
#define CM4_SWO_P90             APOLLO5_PINMUX(90,12)
#define DBIB_WRX_P90            APOLLO5_PINMUX(90,13)
#define RESERVED14_P90          APOLLO5_PINMUX(90,14)
#define RESERVED15_P90          APOLLO5_PINMUX(90,15)

#define DISP_R2_P91             APOLLO5_PINMUX(91,0)
#define RESERVED1_P91           APOLLO5_PINMUX(91,1)
#define CLKOUT_P91              APOLLO5_PINMUX(91,2)
#define GPIO_P91                APOLLO5_PINMUX(91,3)
#define TRIG1_P91               APOLLO5_PINMUX(91,4)
#define COEX_FREQ_P91           APOLLO5_PINMUX(91,5)
#define CT91_P91                APOLLO5_PINMUX(91,6)
#define NCE91_P91               APOLLO5_PINMUX(91,7)
#define OBSBUS11_P91            APOLLO5_PINMUX(91,8)
#define UART1RX_P91             APOLLO5_PINMUX(91,9)
#define UART0RTS_P91            APOLLO5_PINMUX(91,10)
#define FPIO_P91                APOLLO5_PINMUX(91,11)
#define RESERVED12_P91          APOLLO5_PINMUX(91,12)
#define DBIB_RDX_P91            APOLLO5_PINMUX(91,13)
#define RESERVED14_P91          APOLLO5_PINMUX(91,14)
#define RESERVED15_P91          APOLLO5_PINMUX(91,15)

#define DISP_G1_P92             APOLLO5_PINMUX(92,0)
#define CM4_TIMING0_P92         APOLLO5_PINMUX(92,1)
#define DISP_QSPI_D0_P92        APOLLO5_PINMUX(92,2)
#define GPIO_P92                APOLLO5_PINMUX(92,3)
#define TRIG2_P92               APOLLO5_PINMUX(92,4)
#define DISP_SPI_SD_P92         APOLLO5_PINMUX(92,5)
#define CT92_P92                APOLLO5_PINMUX(92,6)
#define NCE92_P92               APOLLO5_PINMUX(92,7)
#define OBSBUS12_P92            APOLLO5_PINMUX(92,8)
#define UART0TX_P92             APOLLO5_PINMUX(92,9)
#define UART1CTS_P92            APOLLO5_PINMUX(92,10)
#define FPIO_P92                APOLLO5_PINMUX(92,11)
#define DISP_SPI_SDO_P92        APOLLO5_PINMUX(92,12)
#define DISP_QSPI_D0_OUT_P92    APOLLO5_PINMUX(92,13)
#define RESERVED14_P92          APOLLO5_PINMUX(92,14)
#define RESERVED15_P92          APOLLO5_PINMUX(92,15)

#define DISP_G2_P93             APOLLO5_PINMUX(93,0)
#define CM4_TIMING1_P93         APOLLO5_PINMUX(93,1)
#define DISP_QSPI_D1_P93        APOLLO5_PINMUX(93,2)
#define GPIO_P93                APOLLO5_PINMUX(93,3)
#define TRIG3_P93               APOLLO5_PINMUX(93,4)
#define DISP_SPI_DCX_P93        APOLLO5_PINMUX(93,5)
#define CT93_P93                APOLLO5_PINMUX(93,6)
#define NCE93_P93               APOLLO5_PINMUX(93,7)
#define OBSBUS13_P93            APOLLO5_PINMUX(93,8)
#define UART0RX_P93             APOLLO5_PINMUX(93,9)
#define UART1RTS_P93            APOLLO5_PINMUX(93,10)
#define FPIO_P93                APOLLO5_PINMUX(93,11)
#define RESERVED12_P93          APOLLO5_PINMUX(93,12)
#define DBIB_D0_P93             APOLLO5_PINMUX(93,13)
#define RESERVED14_P93          APOLLO5_PINMUX(93,14)
#define RESERVED15_P93          APOLLO5_PINMUX(93,15)

#define DISP_B1_P94             APOLLO5_PINMUX(94,0)
#define CM4_TIMING2_P94         APOLLO5_PINMUX(94,1)
#define DISP_QSPI_SCK_P94       APOLLO5_PINMUX(94,2)
#define GPIO_P94                APOLLO5_PINMUX(94,3)
#define TRIG0_P94               APOLLO5_PINMUX(94,4)
#define DISP_SPI_SCK_P94        APOLLO5_PINMUX(94,5)
#define CT94_P94                APOLLO5_PINMUX(94,6)
#define NCE94_P94               APOLLO5_PINMUX(94,7)
#define OBSBUS14_P94            APOLLO5_PINMUX(94,8)
#define UART1TX_P94             APOLLO5_PINMUX(94,9)
#define UART0CTS_P94            APOLLO5_PINMUX(94,10)
#define FPIO_P94                APOLLO5_PINMUX(94,11)
#define RESERVED12_P94          APOLLO5_PINMUX(94,12)
#define DBIB_D1_P94             APOLLO5_PINMUX(94,13)
#define RESERVED14_P94          APOLLO5_PINMUX(94,14)
#define RESERVED15_P94          APOLLO5_PINMUX(94,15)

#define DISP_B2_P95             APOLLO5_PINMUX(95,0)
#define CM4_TIMING3_P95         APOLLO5_PINMUX(95,1)
#define DISP_QSPI_D2_P95        APOLLO5_PINMUX(95,2)
#define GPIO_P95                APOLLO5_PINMUX(95,3)
#define TRIG1_P95               APOLLO5_PINMUX(95,4)
#define DISP_SPI_SDI_P95        APOLLO5_PINMUX(95,5)
#define CT95_P95                APOLLO5_PINMUX(95,6)
#define NCE95_P95               APOLLO5_PINMUX(95,7)
#define OBSBUS15_P95            APOLLO5_PINMUX(95,8)
#define UART1RX_P95             APOLLO5_PINMUX(95,9)
#define UART0RTS_P95            APOLLO5_PINMUX(95,10)
#define FPIO_P95                APOLLO5_PINMUX(95,11)
#define RF_XCVR_TST1_P95        APOLLO5_PINMUX(95,12)
#define DBIB_D2_P95             APOLLO5_PINMUX(95,13)
#define RESERVED14_P95          APOLLO5_PINMUX(95,14)
#define RESERVED15_P95          APOLLO5_PINMUX(95,15)

#define DISP_HST_P96            APOLLO5_PINMUX(96,0)
#define CM4_TIMING4_P96         APOLLO5_PINMUX(96,1)
#define DISP_QSPI_D3_P96        APOLLO5_PINMUX(96,2)
#define GPIO_P96                APOLLO5_PINMUX(96,3)
#define TRIG2_P96               APOLLO5_PINMUX(96,4)
#define DISP_SPI_RST_P96        APOLLO5_PINMUX(96,5)
#define CT96_P96                APOLLO5_PINMUX(96,6)
#define NCE96_P96               APOLLO5_PINMUX(96,7)
#define OBSBUS0_P96             APOLLO5_PINMUX(96,8)
#define UART0TX_P96             APOLLO5_PINMUX(96,9)
#define UART1CTS_P96            APOLLO5_PINMUX(96,10)
#define FPIO_P96                APOLLO5_PINMUX(96,11)
#define RF_XCVR_TST2_P96        APOLLO5_PINMUX(96,12)
#define DBIB_D3_P96             APOLLO5_PINMUX(96,13)
#define RESERVED14_P96          APOLLO5_PINMUX(96,14)
#define RESERVED15_P96          APOLLO5_PINMUX(96,15)

#define DISP_VST_P97            APOLLO5_PINMUX(97,0)
#define CM4_TIMING5_P97         APOLLO5_PINMUX(97,1)
#define RESERVED2_P97           APOLLO5_PINMUX(97,2)
#define GPIO_P97                APOLLO5_PINMUX(97,3)
#define TRIG3_P97               APOLLO5_PINMUX(97,4)
#define SWO_P97                 APOLLO5_PINMUX(97,5)
#define CT97_P97                APOLLO5_PINMUX(97,6)
#define NCE97_P97               APOLLO5_PINMUX(97,7)
#define OBSBUS1_P97             APOLLO5_PINMUX(97,8)
#define UART0RX_P97             APOLLO5_PINMUX(97,9)
#define UART1RTS_P97            APOLLO5_PINMUX(97,10)
#define FPIO_P97                APOLLO5_PINMUX(97,11)
#define RF_XCVR_TST3_P97        APOLLO5_PINMUX(97,12)
#define DBIB_D4_P97             APOLLO5_PINMUX(97,13)
#define RESERVED14_P97          APOLLO5_PINMUX(97,14)
#define RESERVED15_P97          APOLLO5_PINMUX(97,15)

