zephyrproject-rtos/hal_ambiq/dts/apollo510L/ambiq-apollo510L-pinmux.h
#define DISP_HCK_P98            APOLLO5_PINMUX(98,0)
#define CM4_TIMING6_P98         APOLLO5_PINMUX(98,1)
#define RESERVED2_P98           APOLLO5_PINMUX(98,2)
#define GPIO_P98                APOLLO5_PINMUX(98,3)
#define TRIG0_P98               APOLLO5_PINMUX(98,4)
#define SWO_P98                 APOLLO5_PINMUX(98,5)
#define CT98_P98                APOLLO5_PINMUX(98,6)
#define NCE98_P98               APOLLO5_PINMUX(98,7)
#define OBSBUS2_P98             APOLLO5_PINMUX(98,8)
#define UART1TX_P98             APOLLO5_PINMUX(98,9)
#define UART0CTS_P98            APOLLO5_PINMUX(98,10)
#define FPIO_P98                APOLLO5_PINMUX(98,11)
#define RESERVED12_P98          APOLLO5_PINMUX(98,12)
#define DBIB_D5_P98             APOLLO5_PINMUX(98,13)
#define RESERVED14_P98          APOLLO5_PINMUX(98,14)
#define RESERVED15_P98          APOLLO5_PINMUX(98,15)

#define DISP_VCK_P99            APOLLO5_PINMUX(99,0)
#define CM4_TIMING7_P99         APOLLO5_PINMUX(99,1)
#define ST_WCI_2W_RXD_P99       APOLLO5_PINMUX(99,2)
#define GPIO_P99                APOLLO5_PINMUX(99,3)
#define TRIG1_P99               APOLLO5_PINMUX(99,4)
#define SWO_P99                 APOLLO5_PINMUX(99,5)
#define CT99_P99                APOLLO5_PINMUX(99,6)
#define NCE99_P99               APOLLO5_PINMUX(99,7)
#define OBSBUS3_P99             APOLLO5_PINMUX(99,8)
#define UART1RX_P99             APOLLO5_PINMUX(99,9)
#define UART0RTS_P99            APOLLO5_PINMUX(99,10)
#define FPIO_P99                APOLLO5_PINMUX(99,11)
#define BTDM_TXEN_P99           APOLLO5_PINMUX(99,12)
#define DBIB_D6_P99             APOLLO5_PINMUX(99,13)
#define RESERVED14_P99          APOLLO5_PINMUX(99,14)
#define RESERVED15_P99          APOLLO5_PINMUX(99,15)

#define DISP_TE_P100            APOLLO5_PINMUX(100,0)
#define ST_WCI_1W_RXD_P100      APOLLO5_PINMUX(100,1)
#define ST_WCI_2W_TXD_P100      APOLLO5_PINMUX(100,2)
#define GPIO_P100               APOLLO5_PINMUX(100,3)
#define TRIG2_P100              APOLLO5_PINMUX(100,4)
#define RESERVED5_P100          APOLLO5_PINMUX(100,5)
#define CT100_P100              APOLLO5_PINMUX(100,6)
#define NCE100_P100             APOLLO5_PINMUX(100,7)
#define OBSBUS4_P100            APOLLO5_PINMUX(100,8)
#define UART0TX_P100            APOLLO5_PINMUX(100,9)
#define UART1CTS_P100           APOLLO5_PINMUX(100,10)
#define FPIO_P100               APOLLO5_PINMUX(100,11)
#define BTDM_RXEN_P100          APOLLO5_PINMUX(100,12)
#define DBIB_D7_P100            APOLLO5_PINMUX(100,13)
#define RESERVED14_P100         APOLLO5_PINMUX(100,14)
#define RESERVED15_P100         APOLLO5_PINMUX(100,15)

#define DISP_QSPI_CS_N_P101     APOLLO5_PINMUX(101,0)
#define RESERVED1_P101          APOLLO5_PINMUX(101,1)
#define BTDM_TXEN_P101          APOLLO5_PINMUX(101,2)
#define GPIO_P101               APOLLO5_PINMUX(101,3)
#define TRIG3_P101              APOLLO5_PINMUX(101,4)
#define DISP_SPI_CS_N_P101      APOLLO5_PINMUX(101,5)
#define CT101_P101              APOLLO5_PINMUX(101,6)
#define NCE101_P101             APOLLO5_PINMUX(101,7)
#define OBSBUS5_P101            APOLLO5_PINMUX(101,8)
#define UART0RX_P101            APOLLO5_PINMUX(101,9)
#define UART1RTS_P101           APOLLO5_PINMUX(101,10)
#define FPIO_P101               APOLLO5_PINMUX(101,11)
#define ST_WCI_1W_RXD_P101      APOLLO5_PINMUX(101,12)
#define ST_WCI_2W_TXD_P101      APOLLO5_PINMUX(101,13)
#define RESERVED14_P101         APOLLO5_PINMUX(101,14)
#define RESERVED15_P101         APOLLO5_PINMUX(101,15)

#define SLFDSCK_P102            APOLLO5_PINMUX(102,0)
#define SLFDSCL_P102            APOLLO5_PINMUX(102,1)
#define PDMI2S0_CLK_P102        APOLLO5_PINMUX(102,2)
#define GPIO_P102               APOLLO5_PINMUX(102,3)
#define TRIG0_P102              APOLLO5_PINMUX(102,4)
#define RESERVED5_P102          APOLLO5_PINMUX(102,5)
#define CT102_P102              APOLLO5_PINMUX(102,6)
#define NCE102_P102             APOLLO5_PINMUX(102,7)
#define OBSBUS6_P102            APOLLO5_PINMUX(102,8)
#define UART1TX_P102            APOLLO5_PINMUX(102,9)
#define UART0CTS_P102           APOLLO5_PINMUX(102,10)
#define FPIO_P102               APOLLO5_PINMUX(102,11)
#define RESERVED12_P102         APOLLO5_PINMUX(102,12)
#define DBIB_D8_P102            APOLLO5_PINMUX(102,13)
#define RESERVED14_P102         APOLLO5_PINMUX(102,14)
#define RESERVED15_P102         APOLLO5_PINMUX(102,15)

#define SLFDMOSI_P103           APOLLO5_PINMUX(103,0)
#define SLFDSDAWIR3_P103        APOLLO5_PINMUX(103,1)
#define PDMI2S0_SDOUT_P103      APOLLO5_PINMUX(103,2)
#define GPIO_P103               APOLLO5_PINMUX(103,3)
#define TRIG1_P103              APOLLO5_PINMUX(103,4)
#define RESERVED5_P103          APOLLO5_PINMUX(103,5)
#define CT103_P103              APOLLO5_PINMUX(103,6)
#define NCE103_P103             APOLLO5_PINMUX(103,7)
#define OBSBUS7_P103            APOLLO5_PINMUX(103,8)
#define UART1RX_P103            APOLLO5_PINMUX(103,9)
#define UART0RTS_P103           APOLLO5_PINMUX(103,10)
#define FPIO_P103               APOLLO5_PINMUX(103,11)
#define RESERVED12_P103         APOLLO5_PINMUX(103,12)
#define DBIB_D9_P103            APOLLO5_PINMUX(103,13)
#define RESERVED14_P103         APOLLO5_PINMUX(103,14)
#define RESERVED15_P103         APOLLO5_PINMUX(103,15)

#define SLFDMISO_P104           APOLLO5_PINMUX(104,0)
#define BTDM_TXEN_P104          APOLLO5_PINMUX(104,1)
#define PDMI2S0_WS_P104         APOLLO5_PINMUX(104,2)
#define GPIO_P104               APOLLO5_PINMUX(104,3)
#define TRIG2_P104              APOLLO5_PINMUX(104,4)
#define RESERVED5_P104          APOLLO5_PINMUX(104,5)
#define CT104_P104              APOLLO5_PINMUX(104,6)
#define NCE104_P104             APOLLO5_PINMUX(104,7)
#define OBSBUS8_P104            APOLLO5_PINMUX(104,8)
#define UART0TX_P104            APOLLO5_PINMUX(104,9)
#define UART1CTS_P104           APOLLO5_PINMUX(104,10)
#define FPIO_P104               APOLLO5_PINMUX(104,11)
#define RESERVED12_P104         APOLLO5_PINMUX(104,12)
#define DBIB_D10_P104           APOLLO5_PINMUX(104,13)
#define RESERVED14_P104         APOLLO5_PINMUX(104,14)
#define RESERVED15_P104         APOLLO5_PINMUX(104,15)

#define SLFDnCE_P105            APOLLO5_PINMUX(105,0)
#define BTDM_RXEN_P105          APOLLO5_PINMUX(105,1)
#define RESERVED2_P105          APOLLO5_PINMUX(105,2)
#define GPIO_P105               APOLLO5_PINMUX(105,3)
#define TRIG3_P105              APOLLO5_PINMUX(105,4)
#define RESERVED5_P105          APOLLO5_PINMUX(105,5)
#define CT105_P105              APOLLO5_PINMUX(105,6)
#define NCE105_P105             APOLLO5_PINMUX(105,7)
#define OBSBUS9_P105            APOLLO5_PINMUX(105,8)
#define UART0RX_P105            APOLLO5_PINMUX(105,9)
#define UART1RTS_P105           APOLLO5_PINMUX(105,10)
#define FPIO_P105               APOLLO5_PINMUX(105,11)
#define RESERVED12_P105         APOLLO5_PINMUX(105,12)
#define DBIB_D11_P105           APOLLO5_PINMUX(105,13)
#define RESERVED14_P105         APOLLO5_PINMUX(105,14)
#define RESERVED15_P105         APOLLO5_PINMUX(105,15)

#define SLFDINT_P106            APOLLO5_PINMUX(106,0)
#define I2S0_MCLK_P106          APOLLO5_PINMUX(106,1)
#define RESERVED2_P106          APOLLO5_PINMUX(106,2)
#define GPIO_P106               APOLLO5_PINMUX(106,3)
#define TRIG0_P106              APOLLO5_PINMUX(106,4)
#define ST_WCI_2W_RXD_P106      APOLLO5_PINMUX(106,5)
#define CT106_P106              APOLLO5_PINMUX(106,6)
#define NCE106_P106             APOLLO5_PINMUX(106,7)
#define OBSBUS10_P106           APOLLO5_PINMUX(106,8)
#define UART1TX_P106            APOLLO5_PINMUX(106,9)
#define UART0CTS_P106           APOLLO5_PINMUX(106,10)
#define FPIO_P106               APOLLO5_PINMUX(106,11)
#define RESERVED12_P106         APOLLO5_PINMUX(106,12)
#define DBIB_D12_P106           APOLLO5_PINMUX(106,13)
#define RESERVED14_P106         APOLLO5_PINMUX(106,14)
#define RESERVED15_P106         APOLLO5_PINMUX(106,15)

#define PDM0_CLK_P107           APOLLO5_PINMUX(107,0)
#define RESERVED1_P107          APOLLO5_PINMUX(107,1)
#define RESERVED2_P107          APOLLO5_PINMUX(107,2)
#define GPIO_P107               APOLLO5_PINMUX(107,3)
#define TRIG1_P107              APOLLO5_PINMUX(107,4)
#define RESERVED5_P107          APOLLO5_PINMUX(107,5)
#define CT107_P107              APOLLO5_PINMUX(107,6)
#define NCE107_P107             APOLLO5_PINMUX(107,7)
#define OBSBUS11_P107           APOLLO5_PINMUX(107,8)
#define UART1RX_P107            APOLLO5_PINMUX(107,9)
#define UART0RTS_P107           APOLLO5_PINMUX(107,10)
#define FPIO_P107               APOLLO5_PINMUX(107,11)
#define RESERVED12_P107         APOLLO5_PINMUX(107,12)
#define DBIB_D13_P107           APOLLO5_PINMUX(107,13)
#define RESERVED14_P107         APOLLO5_PINMUX(107,14)
#define RESERVED15_P107         APOLLO5_PINMUX(107,15)

#define PDM0_DATA_P108          APOLLO5_PINMUX(108,0)
#define RESERVED1_P108          APOLLO5_PINMUX(108,1)
#define RESERVED2_P108          APOLLO5_PINMUX(108,2)
#define GPIO_P108               APOLLO5_PINMUX(108,3)
#define TRIG2_P108              APOLLO5_PINMUX(108,4)
#define RESERVED5_P108          APOLLO5_PINMUX(108,5)
#define CT108_P108              APOLLO5_PINMUX(108,6)
#define NCE108_P108             APOLLO5_PINMUX(108,7)
#define OBSBUS12_P108           APOLLO5_PINMUX(108,8)
#define UART0TX_P108            APOLLO5_PINMUX(108,9)
#define UART1CTS_P108           APOLLO5_PINMUX(108,10)
#define FPIO_P108               APOLLO5_PINMUX(108,11)
#define RESERVED12_P108         APOLLO5_PINMUX(108,12)
#define DBIB_D14_P108           APOLLO5_PINMUX(108,13)
#define RESERVED14_P108         APOLLO5_PINMUX(108,14)
#define RESERVED15_P108         APOLLO5_PINMUX(108,15)

