zephyrproject-rtos/hal_ambiq/dts/apollo510L/ambiq-apollo510L-pinmux.h
#define I2S0_CLK_P109           APOLLO5_PINMUX(109,0)
#define PDMI2S0_CLK_P109        APOLLO5_PINMUX(109,1)
#define RESERVED2_P109          APOLLO5_PINMUX(109,2)
#define GPIO_P109               APOLLO5_PINMUX(109,3)
#define TRIG3_P109              APOLLO5_PINMUX(109,4)
#define RESERVED5_P109          APOLLO5_PINMUX(109,5)
#define CT109_P109              APOLLO5_PINMUX(109,6)
#define NCE109_P109             APOLLO5_PINMUX(109,7)
#define OBSBUS13_P109           APOLLO5_PINMUX(109,8)
#define UART0RX_P109            APOLLO5_PINMUX(109,9)
#define UART1RTS_P109           APOLLO5_PINMUX(109,10)
#define FPIO_P109               APOLLO5_PINMUX(109,11)
#define RESERVED12_P109         APOLLO5_PINMUX(109,12)
#define DBIB_D15_P109           APOLLO5_PINMUX(109,13)
#define RESERVED14_P109         APOLLO5_PINMUX(109,14)
#define RESERVED15_P109         APOLLO5_PINMUX(109,15)

#define MNCE2_0_P110            APOLLO5_PINMUX(110,0)
#define RESERVED1_P110          APOLLO5_PINMUX(110,1)
#define RESERVED2_P110          APOLLO5_PINMUX(110,2)
#define GPIO_P110               APOLLO5_PINMUX(110,3)
#define TRIG0_P110              APOLLO5_PINMUX(110,4)
#define RESERVED5_P110          APOLLO5_PINMUX(110,5)
#define CT110_P110              APOLLO5_PINMUX(110,6)
#define NCE110_P110             APOLLO5_PINMUX(110,7)
#define OBSBUS14_P110           APOLLO5_PINMUX(110,8)
#define UART1TX_P110            APOLLO5_PINMUX(110,9)
#define UART0CTS_P110           APOLLO5_PINMUX(110,10)
#define FPIO_P110               APOLLO5_PINMUX(110,11)
#define RESERVED12_P110         APOLLO5_PINMUX(110,12)
#define RESERVED13_P110         APOLLO5_PINMUX(110,13)
#define RESERVED14_P110         APOLLO5_PINMUX(110,14)
#define RESERVED15_P110         APOLLO5_PINMUX(110,15)

#define MNCE2_1_P111            APOLLO5_PINMUX(111,0)
#define RESERVED1_P111          APOLLO5_PINMUX(111,1)
#define RESERVED2_P111          APOLLO5_PINMUX(111,2)
#define GPIO_P111               APOLLO5_PINMUX(111,3)
#define TRIG1_P111              APOLLO5_PINMUX(111,4)
#define ST_WCI_2W_RXD_P111      APOLLO5_PINMUX(111,5)
#define CT111_P111              APOLLO5_PINMUX(111,6)
#define NCE111_P111             APOLLO5_PINMUX(111,7)
#define OBSBUS15_P111           APOLLO5_PINMUX(111,8)
#define UART1RX_P111            APOLLO5_PINMUX(111,9)
#define UART0RTS_P111           APOLLO5_PINMUX(111,10)
#define FPIO_P111               APOLLO5_PINMUX(111,11)
#define BTDM_RXEN_P111          APOLLO5_PINMUX(111,12)
#define RESERVED13_P111         APOLLO5_PINMUX(111,13)
#define RESERVED14_P111         APOLLO5_PINMUX(111,14)
#define RESERVED15_P111         APOLLO5_PINMUX(111,15)

#define MSPI2_8_P112            APOLLO5_PINMUX(112,0)
#define RESERVED1_P112          APOLLO5_PINMUX(112,1)
#define RESERVED2_P112          APOLLO5_PINMUX(112,2)
#define GPIO_P112               APOLLO5_PINMUX(112,3)
#define TRIG2_P112              APOLLO5_PINMUX(112,4)
#define RESERVED5_P112          APOLLO5_PINMUX(112,5)
#define CT112_P112              APOLLO5_PINMUX(112,6)
#define NCE112_P112             APOLLO5_PINMUX(112,7)
#define OBSBUS0_P112            APOLLO5_PINMUX(112,8)
#define UART0TX_P112            APOLLO5_PINMUX(112,9)
#define UART1CTS_P112           APOLLO5_PINMUX(112,10)
#define FPIO_P112               APOLLO5_PINMUX(112,11)
#define RESERVED12_P112         APOLLO5_PINMUX(112,12)
#define RESERVED13_P112         APOLLO5_PINMUX(112,13)
#define RESERVED14_P112         APOLLO5_PINMUX(112,14)
#define RESERVED15_P112         APOLLO5_PINMUX(112,15)

#define DISP_QSPI_CS_N_P113     APOLLO5_PINMUX(113,0)
#define RESERVED1_P113          APOLLO5_PINMUX(113,1)
#define ST_WCI_2W_RXD_P113      APOLLO5_PINMUX(113,2)
#define GPIO_P113               APOLLO5_PINMUX(113,3)
#define TRIG3_P113              APOLLO5_PINMUX(113,4)
#define DISP_SPI_CS_N_P113      APOLLO5_PINMUX(113,5)
#define CT113_P113              APOLLO5_PINMUX(113,6)
#define NCE113_P113             APOLLO5_PINMUX(113,7)
#define OBSBUS1_P113            APOLLO5_PINMUX(113,8)
#define UART0RX_P113            APOLLO5_PINMUX(113,9)
#define UART1RTS_P113           APOLLO5_PINMUX(113,10)
#define FPIO_P113               APOLLO5_PINMUX(113,11)
#define BTDM_TXEN_P113          APOLLO5_PINMUX(113,12)
#define RESERVED13_P113         APOLLO5_PINMUX(113,13)
#define RESERVED14_P113         APOLLO5_PINMUX(113,14)
#define RESERVED15_P113         APOLLO5_PINMUX(113,15)

#define SDIF0_DAT4_P114         APOLLO5_PINMUX(114,0)
#define CM4_TIMING0_P114        APOLLO5_PINMUX(114,1)
#define BTDM_TXEN_P114          APOLLO5_PINMUX(114,2)
#define GPIO_P114               APOLLO5_PINMUX(114,3)
#define TRIG0_P114              APOLLO5_PINMUX(114,4)
#define RESERVED5_P114          APOLLO5_PINMUX(114,5)
#define CT114_P114              APOLLO5_PINMUX(114,6)
#define NCE114_P114             APOLLO5_PINMUX(114,7)
#define OBSBUS2_P114            APOLLO5_PINMUX(114,8)
#define UART1TX_P114            APOLLO5_PINMUX(114,9)
#define UART0CTS_P114           APOLLO5_PINMUX(114,10)
#define FPIO_P114               APOLLO5_PINMUX(114,11)
#define RESERVED12_P114         APOLLO5_PINMUX(114,12)
#define RESERVED13_P114         APOLLO5_PINMUX(114,13)
#define RESERVED14_P114         APOLLO5_PINMUX(114,14)
#define RESERVED15_P114         APOLLO5_PINMUX(114,15)

#define SDIF0_DAT5_P115         APOLLO5_PINMUX(115,0)
#define CM4_TIMING1_P115        APOLLO5_PINMUX(115,1)
#define BTDM_RXEN_P115          APOLLO5_PINMUX(115,2)
#define GPIO_P115               APOLLO5_PINMUX(115,3)
#define TRIG1_P115              APOLLO5_PINMUX(115,4)
#define RESERVED5_P115          APOLLO5_PINMUX(115,5)
#define CT115_P115              APOLLO5_PINMUX(115,6)
#define NCE115_P115             APOLLO5_PINMUX(115,7)
#define OBSBUS3_P115            APOLLO5_PINMUX(115,8)
#define UART1RX_P115            APOLLO5_PINMUX(115,9)
#define UART0RTS_P115           APOLLO5_PINMUX(115,10)
#define FPIO_P115               APOLLO5_PINMUX(115,11)
#define RESERVED12_P115         APOLLO5_PINMUX(115,12)
#define RESERVED13_P115         APOLLO5_PINMUX(115,13)
#define RESERVED14_P115         APOLLO5_PINMUX(115,14)
#define RESERVED15_P115         APOLLO5_PINMUX(115,15)

#define SDIF0_DAT6_P116         APOLLO5_PINMUX(116,0)
#define CM4_TIMING2_P116        APOLLO5_PINMUX(116,1)
#define RESERVED2_P116          APOLLO5_PINMUX(116,2)
#define GPIO_P116               APOLLO5_PINMUX(116,3)
#define TRIG2_P116              APOLLO5_PINMUX(116,4)
#define SWO_P116                APOLLO5_PINMUX(116,5)
#define CT116_P116              APOLLO5_PINMUX(116,6)
#define NCE116_P116             APOLLO5_PINMUX(116,7)
#define OBSBUS4_P116            APOLLO5_PINMUX(116,8)
#define UART0TX_P116            APOLLO5_PINMUX(116,9)
#define UART1CTS_P116           APOLLO5_PINMUX(116,10)
#define FPIO_P116               APOLLO5_PINMUX(116,11)
#define RESERVED12_P116         APOLLO5_PINMUX(116,12)
#define RESERVED13_P116         APOLLO5_PINMUX(116,13)
#define RESERVED14_P116         APOLLO5_PINMUX(116,14)
#define RESERVED15_P116         APOLLO5_PINMUX(116,15)

#define SDIF0_DAT7_P117         APOLLO5_PINMUX(117,0)
#define CM4_TIMING3_P117        APOLLO5_PINMUX(117,1)
#define RESERVED2_P117          APOLLO5_PINMUX(117,2)
#define GPIO_P117               APOLLO5_PINMUX(117,3)
#define TRIG3_P117              APOLLO5_PINMUX(117,4)
#define SWO_P117                APOLLO5_PINMUX(117,5)
#define CT117_P117              APOLLO5_PINMUX(117,6)
#define NCE117_P117             APOLLO5_PINMUX(117,7)
#define OBSBUS5_P117            APOLLO5_PINMUX(117,8)
#define UART0RX_P117            APOLLO5_PINMUX(117,9)
#define UART1RTS_P117           APOLLO5_PINMUX(117,10)
#define FPIO_P117               APOLLO5_PINMUX(117,11)
#define RESERVED12_P117         APOLLO5_PINMUX(117,12)
#define RESERVED13_P117         APOLLO5_PINMUX(117,13)
#define RESERVED14_P117         APOLLO5_PINMUX(117,14)
#define RESERVED15_P117         APOLLO5_PINMUX(117,15)

#define I2S0_MCLK_P118          APOLLO5_PINMUX(118,0)
#define CM4_TIMING4_P118        APOLLO5_PINMUX(118,1)
#define PDMI2S0_CLK_P118        APOLLO5_PINMUX(118,2)
#define GPIO_P118               APOLLO5_PINMUX(118,3)
#define TRIG0_P118              APOLLO5_PINMUX(118,4)
#define SWO_P118                APOLLO5_PINMUX(118,5)
#define CT118_P118              APOLLO5_PINMUX(118,6)
#define NCE118_P118             APOLLO5_PINMUX(118,7)
#define OBSBUS6_P118            APOLLO5_PINMUX(118,8)
#define UART1TX_P118            APOLLO5_PINMUX(118,9)
#define UART0CTS_P118           APOLLO5_PINMUX(118,10)
#define FPIO_P118               APOLLO5_PINMUX(118,11)
#define I2S0_CLK_P118           APOLLO5_PINMUX(118,12)
#define RESERVED13_P118         APOLLO5_PINMUX(118,13)
#define RESERVED14_P118         APOLLO5_PINMUX(118,14)
#define RESERVED15_P118         APOLLO5_PINMUX(118,15)

#define RESERVED0_P119          APOLLO5_PINMUX(119,0)
#define RESERVED1_P119          APOLLO5_PINMUX(119,1)
#define BTDM_RXEN_P119          APOLLO5_PINMUX(119,2)
#define GPIO_P119               APOLLO5_PINMUX(119,3)
#define TRIG1_P119              APOLLO5_PINMUX(119,4)
#define SWO_P119                APOLLO5_PINMUX(119,5)
#define CT119_P119              APOLLO5_PINMUX(119,6)
#define NCE119_P119             APOLLO5_PINMUX(119,7)
#define OBSBUS7_P119            APOLLO5_PINMUX(119,8)
#define UART1RX_P119            APOLLO5_PINMUX(119,9)
#define UART0RTS_P119           APOLLO5_PINMUX(119,10)
#define FPIO_P119               APOLLO5_PINMUX(119,11)
#define ST_WCI_2W_RXD_P119      APOLLO5_PINMUX(119,12)
#define RESERVED13_P119         APOLLO5_PINMUX(119,13)
#define RESERVED14_P119         APOLLO5_PINMUX(119,14)
#define RESERVED15_P119         APOLLO5_PINMUX(119,15)

#endif /* __APOLLO510L_PINMUX_H__ */
